export const allIdioms = [
  [
    ['爱', '憎', '分', '明'],
    ['ai', 'zeng', 'fen', 'ming'],
  ],
  [
    ['安', '分', '守', '己'],
    ['an', 'fen', 'shou', 'ji'],
  ],
  [
    ['安', '居', '乐', '业'],
    ['an', 'ju', 'le', 'ye'],
  ],
  [
    ['安', '然', '无', '恙'],
    ['an', 'ran', 'wu', 'yang'],
  ],
  [
    ['安', '身', '立', '命'],
    ['an', 'shen', 'li', 'ming'],
  ],
  [
    ['鞍', '前', '马', '后'],
    ['an', 'qian', 'ma', 'hou'],
  ],
  [
    ['按', '部', '就', '班'],
    ['an', 'bu', 'jiu', 'ban'],
  ],
  [
    ['暗', '度', '陈', '仓'],
    ['an', 'du', 'chen', 'cang'],
  ],
  [
    ['暗', '箭', '伤', '人'],
    ['an', 'jian', 'shang', 'ren'],
  ],
  [
    ['暗', '无', '天', '日'],
    ['an', 'wu', 'tian', 'ri'],
  ],
  [
    ['黯', '然', '销', '魂'],
    ['an', 'ran', 'xiao', 'hun'],
  ],
  [
    ['昂', '首', '挺', '胸'],
    ['ang', 'shou', 'ting', 'xiong'],
  ],
  [
    ['嗷', '嗷', '待', '哺'],
    ['ao', 'ao', 'dai', 'bu'],
  ],
  [
    ['跋', '山', '涉', '水'],
    ['ba', 'shan', 'she', 'shui'],
  ],
  [
    ['霸', '王', '别', '姬'],
    ['ba', 'wang', 'bie', 'ji'],
  ],
  [
    ['白', '驹', '过', '隙'],
    ['bai', 'ju', 'guo', 'xi'],
  ],
  [
    ['白', '手', '起', '家'],
    ['bai', 'shou', 'qi', 'jia'],
  ],
  [
    ['白', '头', '偕', '老'],
    ['bai', 'tou', 'xie', 'lao'],
  ],
  [
    ['百', '步', '穿', '杨'],
    ['bai', 'bu', 'chuan', 'yang'],
  ],
  [
    ['百', '尺', '竿', '头'],
    ['bai', 'chi', 'gan', 'tou'],
  ],
  [
    ['百', '废', '待', '兴'],
    ['bai', 'fei', 'dai', 'xing'],
  ],
  [
    ['百', '感', '交', '集'],
    ['bai', 'gan', 'jiao', 'ji'],
  ],
  [
    ['百', '花', '齐', '放'],
    ['bai', 'hua', 'qi', 'fang'],
  ],
  [
    ['百', '口', '莫', '辩'],
    ['bai', 'kou', 'mo', 'bian'],
  ],
  [
    ['百', '里', '挑', '一'],
    ['bai', 'li', 'tiao', 'yi'],
  ],
  [
    ['百', '密', '一', '疏'],
    ['bai', 'mi', 'yi', 'shu'],
  ],
  [
    ['百', '年', '好', '合'],
    ['bai', 'nian', 'hao', 'he'],
  ],
  [
    ['百', '鸟', '朝', '凤'],
    ['bai', 'niao', 'chao', 'feng'],
  ],
  [
    ['班', '门', '弄', '斧'],
    ['ban', 'men', 'nong', 'fu'],
  ],
  [
    ['斑', '驳', '陆', '离'],
    ['ban', 'bo', 'lu', 'li'],
  ],
  [
    ['搬', '弄', '是', '非'],
    ['ban', 'nong', 'shi', 'fei'],
  ],
  [
    ['半', '途', '而', '废'],
    ['ban', 'tu', 'er', 'fei'],
  ],
  [
    ['包', '罗', '万', '象'],
    ['bao', 'luo', 'wan', 'xiang'],
  ],
  [
    ['饱', '食', '终', '日'],
    ['bao', 'shi', 'zhong', 'ri'],
  ],
  [
    ['抱', '头', '鼠', '窜'],
    ['bao', 'tou', 'shu', 'cuan'],
  ],
  [
    ['暴', '殄', '天', '物'],
    ['bao', 'tian', 'tian', 'wu'],
  ],
  [
    ['暴', '跳', '如', '雷'],
    ['bao', 'tiao', 'ru', 'lei'],
  ],
  [
    ['卑', '躬', '屈', '膝'],
    ['bei', 'gong', 'qu', 'xi'],
  ],
  [
    ['杯', '弓', '蛇', '影'],
    ['bei', 'gong', 'she', 'ying'],
  ],
  [
    ['悲', '欢', '离', '合'],
    ['bei', 'huan', 'li', 'he'],
  ],
  [
    ['悲', '天', '悯', '人'],
    ['bei', 'tian', 'min', 'ren'],
  ],
  [
    ['背', '井', '离', '乡'],
    ['bei', 'jing', 'li', 'xiang'],
  ],
  [
    ['背', '信', '弃', '义'],
    ['bei', 'xin', 'qi', 'yi'],
  ],
  [
    ['本', '末', '倒', '置'],
    ['ben', 'mo', 'dao', 'zhi'],
  ],
  [
    ['笨', '鸟', '先', '飞'],
    ['ben', 'niao', 'xian', 'fei'],
  ],
  [
    ['比', '比', '皆', '是'],
    ['bi', 'bi', 'jie', 'shi'],
  ],
  [
    ['闭', '门', '造', '车'],
    ['bi', 'men', 'zao', 'che'],
  ],
  [
    ['闭', '月', '羞', '花'],
    ['bi', 'yue', 'xiu', 'hua'],
  ],
  [
    ['筚', '路', '褴', '褛'],
    ['bi', 'lu', 'lan', 'lv'],
  ],
  [
    ['弊', '帚', '自', '珍'],
    ['bi', 'zhou', 'zi', 'zhen'],
  ],
  [
    ['避', '重', '就', '轻'],
    ['bi', 'zhong', 'jiu', 'qing'],
  ],
  [
    ['鞭', '长', '莫', '及'],
    ['bian', 'chang', 'mo', 'ji'],
  ],
  [
    ['变', '本', '加', '厉'],
    ['bian', 'ben', 'jia', 'li'],
  ],
  [
    ['遍', '体', '鳞', '伤'],
    ['bian', 'ti', 'lin', 'shang'],
  ],
  [
    ['标', '新', '立', '异'],
    ['biao', 'xin', 'li', 'yi'],
  ],
  [
    ['别', '出', '心', '裁'],
    ['bie', 'chu', 'xin', 'cai'],
  ],
  [
    ['别', '开', '生', '面'],
    ['bie', 'kai', 'sheng', 'mian'],
  ],
  [
    ['别', '来', '无', '恙'],
    ['bie', 'lai', 'wu', 'yang'],
  ],
  [
    ['别', '有', '洞', '天'],
    ['bie', 'you', 'dong', 'tian'],
  ],
  [
    ['别', '有', '用', '心'],
    ['bie', 'you', 'yong', 'xin'],
  ],
  [
    ['宾', '朋', '满', '座'],
    ['bin', 'peng', 'man', 'zuo'],
  ],
  [
    ['宾', '至', '如', '归'],
    ['bin', 'zhi', 'ru', 'gui'],
  ],
  [
    ['彬', '彬', '有', '礼'],
    ['bin', 'bin', 'you', 'li'],
  ],
  [
    ['兵', '不', '厌', '诈'],
    ['bing', 'bu', 'yan', 'zha'],
  ],
  [
    ['兵', '慌', '马', '乱'],
    ['bing', 'huang', 'ma', 'luan'],
  ],
  [
    ['病', '入', '膏', '肓'],
    ['bing', 'ru', 'gao', 'huang'],
  ],
  [
    ['拨', '乱', '反', '正'],
    ['bo', 'luan', 'fan', 'zheng'],
  ],
  [
    ['拨', '云', '见', '日'],
    ['bo', 'yun', 'jian', 'ri'],
  ],
  [
    ['博', '大', '精', '深'],
    ['bo', 'da', 'jing', 'shen'],
  ],
  [
    ['博', '古', '通', '今'],
    ['bo', 'gu', 'tong', 'jin'],
  ],
  [
    ['博', '闻', '强', '识'],
    ['bo', 'wen', 'qiang', 'zhi'],
  ],
  [
    ['捕', '风', '捉', '影'],
    ['bu', 'feng', 'zhuo', 'ying'],
  ],
  [
    ['不', '卑', '不', '亢'],
    ['bu', 'bei', 'bu', 'kang'],
  ],
  [
    ['不', '耻', '下', '问'],
    ['bu', 'chi', 'xia', 'wen'],
  ],
  [
    ['不', '出', '所', '料'],
    ['bu', 'chu', 'suo', 'liao'],
  ],
  [
    ['不', '辞', '而', '别'],
    ['bu', 'ci', 'er', 'bie'],
  ],
  [
    ['不', '打', '自', '招'],
    ['bu', 'da', 'zi', 'zhao'],
  ],
  [
    ['不', '动', '声', '色'],
    ['bu', 'dong', 'sheng', 'se'],
  ],
  [
    ['不', '分', '伯', '仲'],
    ['bu', 'fen', 'bo', 'zhong'],
  ],
  [
    ['不', '负', '众', '望'],
    ['bu', 'fu', 'zhong', 'wang'],
  ],
  [
    ['不', '共', '戴', '天'],
    ['bu', 'gong', 'dai', 'tian'],
  ],
  [
    ['不', '加', '思', '索'],
    ['bu', 'jia', 'si', 'suo'],
  ],
  [
    ['不', '见', '天', '日'],
    ['bu', 'jian', 'tian', 'ri'],
  ],
  [
    ['不', '胫', '而', '走'],
    ['bu', 'jing', 'er', 'zou'],
  ],
  [
    ['不', '拘', '小', '节'],
    ['bu', 'ju', 'xiao', 'jie'],
  ],
  [
    ['不', '劳', '而', '获'],
    ['bu', 'lao', 'er', 'huo'],
  ],
  [
    ['不', '谋', '而', '合'],
    ['bu', 'mou', 'er', 'he'],
  ],
  [
    ['不', '务', '正', '业'],
    ['bu', 'wu', 'zheng', 'ye'],
  ],
  [
    ['不', '学', '无', '术'],
    ['bu', 'xue', 'wu', 'shu'],
  ],
  [
    ['不', '言', '而', '喻'],
    ['bu', 'yan', 'er', 'yu'],
  ],
  [
    ['不', '遗', '余', '力'],
    ['bu', 'yi', 'yu', 'li'],
  ],
  [
    ['不', '义', '之', '财'],
    ['bu', 'yi', 'zhi', 'cai'],
  ],
  [
    ['不', '由', '自', '主'],
    ['bu', 'you', 'zi', 'zhu'],
  ],
  [
    ['不', '约', '而', '同'],
    ['bu', 'yue', 'er', 'tong'],
  ],
  [
    ['不', '择', '手', '段'],
    ['bu', 'ze', 'shou', 'duan'],
  ],
  [
    ['不', '足', '为', '奇'],
    ['bu', 'zu', 'wei', 'qi'],
  ],
  [
    ['步', '履', '蹒', '跚'],
    ['bu', 'lv', 'pan', 'shan'],
  ],
  [
    ['步', '履', '维', '艰'],
    ['bu', 'lv', 'wei', 'jian'],
  ],
  [
    ['才', '疏', '学', '浅'],
    ['cai', 'shu', 'xue', 'qian'],
  ],
  [
    ['残', '杯', '冷', '炙'],
    ['can', 'bei', 'leng', 'zhi'],
  ],
  [
    ['仓', '皇', '失', '措'],
    ['cang', 'huang', 'shi', 'cuo'],
  ],
  [
    ['沧', '海', '桑', '田'],
    ['cang', 'hai', 'sang', 'tian'],
  ],
  [
    ['沧', '海', '一', '粟'],
    ['cang', 'hai', 'yi', 'su'],
  ],
  [
    ['藏', '龙', '卧', '虎'],
    ['cang', 'long', 'wo', 'hu'],
  ],
  [
    ['藏', '污', '纳', '垢'],
    ['cang', 'wu', 'na', 'gou'],
  ],
  [
    ['草', '船', '借', '箭'],
    ['cao', 'chuan', 'jie', 'jian'],
  ],
  [
    ['草', '木', '皆', '兵'],
    ['cao', 'mu', 'jie', 'bing'],
  ],
  [
    ['恻', '隐', '之', '心'],
    ['ce', 'yin', 'zhi', 'xin'],
  ],
  [
    ['层', '峦', '迭', '嶂'],
    ['ceng', 'luan', 'die', 'zhang'],
  ],
  [
    ['插', '科', '打', '诨'],
    ['cha', 'ke', 'da', 'hun'],
  ],
  [
    ['察', '言', '观', '色'],
    ['cha', 'yan', 'guan', 'se'],
  ],
  [
    ['差', '强', '人', '意'],
    ['cha', 'qiang', 'ren', 'yi'],
  ],
  [
    ['长', '歌', '当', '哭'],
    ['chang', 'ge', 'dang', 'ku'],
  ],
  [
    ['长', '话', '短', '说'],
    ['chang', 'hua', 'duan', 'shuo'],
  ],
  [
    ['长', '篇', '大', '论'],
    ['chang', 'pian', 'da', 'lun'],
  ],
  [
    ['长', '篇', '累', '牍'],
    ['chang', 'pian', 'lei', 'du'],
  ],
  [
    ['常', '年', '累', '月'],
    ['chang', 'nian', 'lei', 'yue'],
  ],
  [
    ['畅', '所', '欲', '言'],
    ['chang', 'suo', 'yu', 'yan'],
  ],
  [
    ['朝', '三', '暮', '四'],
    ['zhao', 'san', 'mu', 'si'],
  ],
  [
    ['朝', '生', '暮', '死'],
    ['zhao', 'sheng', 'mu', 'si'],
  ],
  [
    ['车', '水', '马', '龙'],
    ['che', 'shui', 'ma', 'long'],
  ],
  [
    ['车', '载', '斗', '量'],
    ['che', 'zai', 'dou', 'liang'],
  ],
  [
    ['沉', '鱼', '落', '雁'],
    ['chen', 'yu', 'luo', 'yan'],
  ],
  [
    ['陈', '词', '滥', '调'],
    ['chen', 'ci', 'lan', 'diao'],
  ],
  [
    ['陈', '规', '陋', '习'],
    ['chen', 'gui', 'lou', 'xi'],
  ],
  [
    ['晨', '钟', '暮', '鼓'],
    ['chen', 'zhong', 'mu', 'gu'],
  ],
  [
    ['趁', '火', '打', '劫'],
    ['chen', 'huo', 'da', 'jie'],
  ],
  [
    ['趁', '虚', '而', '入'],
    ['chen', 'xu', 'er', 'ru'],
  ],
  [
    ['瞠', '目', '结', '舌'],
    ['cheng', 'mu', 'jie', 'she'],
  ],
  [
    ['成', '人', '之', '美'],
    ['cheng', 'ren', 'zhi', 'mei'],
  ],
  [
    ['承', '前', '启', '后'],
    ['cheng', 'qian', 'qi', 'hou'],
  ],
  [
    ['承', '上', '启', '下'],
    ['cheng', 'shang', 'qi', 'xia'],
  ],
  [
    ['乘', '风', '破', '浪'],
    ['cheng', 'feng', 'po', 'lang'],
  ],
  [
    ['趁', '热', '打', '铁'],
    ['chen', 're', 'da', 'tie'],
  ],
  [
    ['乘', '人', '之', '危'],
    ['cheng', 'ren', 'zhi', 'wei'],
  ],
  [
    ['乘', '虚', '而', '入'],
    ['cheng', 'xu', 'er', 'ru'],
  ],
  [
    ['痴', '人', '说', '梦'],
    ['chi', 'ren', 'shuo', 'meng'],
  ],
  [
    ['迟', '暮', '之', '年'],
    ['chi', 'mu', 'zhi', 'nian'],
  ],
  [
    ['持', '之', '以', '恒'],
    ['chi', 'zhi', 'yi', 'heng'],
  ],
  [
    ['赤', '手', '空', '拳'],
    ['chi', 'shou', 'kong', 'quan'],
  ],
  [
    ['充', '耳', '不', '闻'],
    ['chong', 'er', 'bu', 'wen'],
  ],
  [
    ['抽', '丝', '剥', '茧'],
    ['chou', 'si', 'bao', 'jian'],
  ],
  [
    ['臭', '名', '昭', '著'],
    ['chou', 'ming', 'zhao', 'zhu'],
  ],
  [
    ['臭', '味', '相', '投'],
    ['chou', 'wei', 'xiang', 'tou'],
  ],
  [
    ['出', '尔', '反', '尔'],
    ['chu', 'er', 'fan', 'er'],
  ],
  [
    ['出', '类', '拔', '萃'],
    ['chu', 'lei', 'ba', 'cui'],
  ],
  [
    ['出', '谋', '划', '策'],
    ['chu', 'mou', 'hua', 'ce'],
  ],
  [
    ['出', '人', '头', '地'],
    ['chu', 'ren', 'tou', 'di'],
  ],
  [
    ['出', '神', '入', '化'],
    ['chu', 'shen', 'ru', 'hua'],
  ],
  [
    ['出', '师', '不', '利'],
    ['chu', 'shi', 'bu', 'li'],
  ],
  [
    ['出', '水', '芙', '蓉'],
    ['chu', 'shui', 'fu', 'rong'],
  ],
  [
    ['出', '言', '不', '逊'],
    ['chu', 'yan', 'bu', 'xun'],
  ],
  [
    ['初', '出', '茅', '庐'],
    ['chu', 'chu', 'mao', 'lu'],
  ],
  [
    ['锄', '强', '扶', '弱'],
    ['chu', 'qiang', 'fu', 'ruo'],
  ],
  [
    ['楚', '楚', '动', '人'],
    ['chu', 'chu', 'dong', 'ren'],
  ],
  [
    ['处', '心', '积', '虑'],
    ['chu', 'xin', 'ji', 'lv'],
  ],
  [
    ['怵', '目', '惊', '心'],
    ['chu', 'mu', 'jing', 'xin'],
  ],
  [
    ['触', '景', '生', '情'],
    ['chu', 'jing', 'sheng', 'qing'],
  ],
  [
    ['触', '类', '旁', '通'],
    ['chu', 'lei', 'pang', 'tong'],
  ],
  [
    ['穿', '凿', '附', '会'],
    ['chuan', 'zao', 'fu', 'hui'],
  ],
  [
    ['穿', '针', '引', '线'],
    ['chuan', 'zhen', 'yin', 'xian'],
  ],
  [
    ['吹', '毛', '求', '疵'],
    ['chui', 'mao', 'qiu', 'ci'],
  ],
  [
    ['垂', '头', '丧', '气'],
    ['chui', 'tou', 'sang', 'qi'],
  ],
  [
    ['垂', '涎', '三', '尺'],
    ['chui', 'xian', 'san', 'chi'],
  ],
  [
    ['捶', '胸', '顿', '足'],
    ['chui', 'xiong', 'dun', 'zu'],
  ],
  [
    ['春', '风', '化', '雨'],
    ['chun', 'feng', 'hua', 'yu'],
  ],
  [
    ['唇', '亡', '齿', '寒'],
    ['chun', 'wang', 'chi', 'han'],
  ],
  [
    ['蠢', '蠢', '欲', '动'],
    ['chun', 'chun', 'yu', 'dong'],
  ],
  [
    ['绰', '绰', '有', '余'],
    ['chuo', 'chuo', 'you', 'yu'],
  ],
  [
    ['此', '起', '彼', '伏'],
    ['ci', 'qi', 'bi', 'fu'],
  ],
  [
    ['从', '一', '而', '终'],
    ['cong', 'yi', 'er', 'zhong'],
  ],
  [
    ['粗', '枝', '大', '叶'],
    ['cu', 'zhi', 'da', 'ye'],
  ],
  [
    ['打', '草', '惊', '蛇'],
    ['da', 'cao', 'jing', 'she'],
  ],
  [
    ['大', '材', '小', '用'],
    ['da', 'cai', 'xiao', 'yong'],
  ],
  [
    ['大', '海', '捞', '针'],
    ['da', 'hai', 'lao', 'zhen'],
  ],
  [
    ['大', '惊', '小', '怪'],
    ['da', 'jing', 'xiao', 'guai'],
  ],
  [
    ['大', '块', '朵', '颐'],
    ['da', 'kuai', 'duo', 'yi'],
  ],
  [
    ['大', '器', '晚', '成'],
    ['da', 'qi', 'wan', 'cheng'],
  ],
  [
    ['大', '庭', '广', '众'],
    ['da', 'ting', 'guang', 'zhong'],
  ],
  [
    ['大', '音', '希', '声'],
    ['da', 'yin', 'xi', 'sheng'],
  ],
  [
    ['大', '张', '旗', '鼓'],
    ['da', 'zhang', 'qi', 'gu'],
  ],
  [
    ['大', '智', '若', '愚'],
    ['da', 'zhi', 'ruo', 'yu'],
  ],
  [
    ['呆', '若', '木', '鸡'],
    ['dai', 'ruo', 'mu', 'ji'],
  ],
  [
    ['殚', '精', '竭', '虑'],
    ['dan', 'jing', 'jie', 'lv'],
  ],
  [
    ['胆', '战', '心', '惊'],
    ['dan', 'zhan', 'xin', 'jing'],
  ],
  [
    ['弹', '冠', '相', '庆'],
    ['tan', 'guan', 'xiang', 'qing'],
  ],
  [
    ['弹', '尽', '粮', '绝'],
    ['dan', 'jin', 'liang', 'jue'],
  ],
  [
    ['当', '仁', '不', '让'],
    ['dang', 'ren', 'bu', 'rang'],
  ],
  [
    ['道', '貌', '岸', '然'],
    ['dao', 'mao', 'an', 'ran'],
  ],
  [
    ['道', '听', '途', '说'],
    ['dao', 'ting', 'tu', 'shuo'],
  ],
  [
    ['得', '手', '应', '心'],
    ['de', 'shou', 'ying', 'xin'],
  ],
  [
    ['得', '意', '忘', '形'],
    ['de', 'yi', 'wang', 'xing'],
  ],
  [
    ['德', '才', '兼', '备'],
    ['de', 'cai', 'jian', 'bei'],
  ],
  [
    ['登', '峰', '造', '极'],
    ['deng', 'feng', 'zao', 'ji'],
  ],
  [
    ['等', '闲', '之', '辈'],
    ['deng', 'xian', 'zhi', 'bei'],
  ],
  [
    ['低', '唱', '浅', '酌'],
    ['di', 'chang', 'qian', 'zhuo'],
  ],
  [
    ['颠', '沛', '流', '离'],
    ['dian', 'pei', 'liu', 'li'],
  ],
  [
    ['点', '石', '成', '金'],
    ['dian', 'shi', 'cheng', 'jin'],
  ],
  [
    ['雕', '虫', '小', '技'],
    ['diao', 'chong', 'xiao', 'ji'],
  ],
  [
    ['东', '窗', '事', '发'],
    ['dong', 'chuang', 'shi', 'fa'],
  ],
  [
    ['东', '施', '效', '颦'],
    ['dong', 'shi', 'xiao', 'pin'],
  ],
  [
    ['独', '辟', '蹊', '径'],
    ['du', 'pi', 'xi', 'jing'],
  ],
  [
    ['独', '善', '其', '身'],
    ['du', 'shan', 'qi', 'shen'],
  ],
  [
    ['赌', '物', '思', '人'],
    ['du', 'wu', 'si', 'ren'],
  ],
  [
    ['度', '日', '如', '年'],
    ['du', 'ri', 'ru', 'nian'],
  ],
  [
    ['断', '壁', '残', '垣'],
    ['duan', 'bi', 'can', 'yuan'],
  ],
  [
    ['断', '章', '取', '意'],
    ['duan', 'zhang', 'qu', 'yi'],
  ],
  [
    ['对', '酒', '当', '歌'],
    ['dui', 'jiu', 'dang', 'ge'],
  ],
  [
    ['对', '牛', '弹', '琴'],
    ['dui', 'niu', 'tan', 'qin'],
  ],
  [
    ['尔', '虞', '我', '诈'],
    ['er', 'yu', 'wo', 'zha'],
  ],
  [
    ['耳', '鬓', '厮', '磨'],
    ['er', 'bin', 'si', 'mo'],
  ],
  [
    ['反', '璞', '归', '真'],
    ['fan', 'pu', 'gui', 'zhen'],
  ],
  [
    ['方', '兴', '未', '艾'],
    ['fang', 'xing', 'wei', 'ai'],
  ],
  [
    ['防', '微', '杜', '渐'],
    ['fang', 'wei', 'du', 'jian'],
  ],
  [
    ['放', '浪', '形', '骸'],
    ['fang', 'lang', 'xing', 'hai'],
  ],
  [
    ['飞', '扬', '跋', '扈'],
    ['fei', 'yang', 'ba', 'hu'],
  ],
  [
    ['分', '道', '扬', '镳'],
    ['fen', 'dao', 'yang', 'biao'],
  ],
  [
    ['纷', '至', '沓', '来'],
    ['fen', 'zhi', 'ta', 'lai'],
  ],
  [
    ['忿', '世', '嫉', '俗'],
    ['fen', 'shi', 'ji', 'su'],
  ],
  [
    ['风', '餐', '露', '宿'],
    ['feng', 'can', 'lu', 'su'],
  ],
  [
    ['风', '尘', '仆', '仆'],
    ['feng', 'chen', 'pu', 'pu'],
  ],
  [
    ['风', '口', '浪', '尖'],
    ['feng', 'kou', 'lang', 'jian'],
  ],
  [
    ['风', '声', '鹤', '唳'],
    ['feng', 'sheng', 'he', 'li'],
  ],
  [
    ['峰', '回', '路', '转'],
    ['feng', 'hui', 'lu', 'zhuan'],
  ],
  [
    ['锋', '芒', '毕', '露'],
    ['feng', 'mang', 'bi', 'lu'],
  ],
  [
    ['逢', '凶', '化', '吉'],
    ['feng', 'xiong', 'hua', 'ji'],
  ],
  [
    ['凤', '毛', '麟', '角'],
    ['feng', 'mao', 'lin', 'jiao'],
  ],
  [
    ['否', '极', '泰', '来'],
    ['pi', 'ji', 'tai', 'lai'],
  ],
  [
    ['釜', '底', '抽', '薪'],
    ['fu', 'di', 'chou', 'xin'],
  ],
  [
    ['负', '荆', '请', '罪'],
    ['fu', 'jing', 'qing', 'zui'],
  ],
  [
    ['负', '隅', '顽', '抗'],
    ['fu', 'yu', 'wan', 'kang'],
  ],
  [
    ['赴', '汤', '蹈', '火'],
    ['fu', 'tang', 'dao', 'huo'],
  ],
  [
    ['高', '山', '流', '水'],
    ['gao', 'shan', 'liu', 'shui'],
  ],
  [
    ['隔', '靴', '搔', '痒'],
    ['ge', 'xue', 'sao', 'yang'],
  ],
  [
    ['根', '深', '蒂', '固'],
    ['gen', 'shen', 'di', 'gu'],
  ],
  [
    ['耿', '耿', '于', '怀'],
    ['geng', 'geng', 'yu', 'huai'],
  ],
  [
    ['功', '亏', '一', '篑'],
    ['gong', 'kui', 'yi', 'kui'],
  ],
  [
    ['觥', '筹', '交', '错'],
    ['gong', 'chou', 'jiao', 'cuo'],
  ],
  [
    ['沽', '名', '钓', '誉'],
    ['gu', 'ming', 'diao', 'yu'],
  ],
  [
    ['故', '步', '自', '封'],
    ['gu', 'bu', 'zi', 'feng'],
  ],
  [
    ['故', '弄', '玄', '虚'],
    ['gu', 'nong', 'xuan', 'xu'],
  ],
  [
    ['顾', '此', '失', '彼'],
    ['gu', 'ci', 'shi', 'bi'],
  ],
  [
    ['顾', '影', '自', '怜'],
    ['gu', 'ying', 'zi', 'lian'],
  ],
  [
    ['挂', '一', '漏', '万'],
    ['gua', 'yi', 'lou', 'wan'],
  ],
  [
    ['管', '中', '窥', '豹'],
    ['guan', 'zhong', 'kui', 'bao'],
  ],
  [
    ['过', '河', '拆', '桥'],
    ['guo', 'he', 'chai', 'qiao'],
  ],
  [
    ['过', '犹', '不', '及'],
    ['guo', 'you', 'bu', 'ji'],
  ],
  [
    ['海', '底', '捞', '针'],
    ['hai', 'di', 'lao', 'zhen'],
  ],
  [
    ['汗', '牛', '充', '栋'],
    ['han', 'niu', 'chong', 'dong'],
  ],
  [
    ['沆', '瀣', '一', '气'],
    ['hang', 'xie', 'yi', 'qi'],
  ],
  [
    ['红', '杏', '出', '墙'],
    ['hong', 'xing', 'chu', 'qiang'],
  ],
  [
    ['囫', '囵', '吞', '枣'],
    ['hu', 'lun', 'tun', 'zao'],
  ],
  [
    ['虎', '视', '眈', '眈'],
    ['hu', 'shi', 'dan', 'dan'],
  ],
  [
    ['花', '言', '巧', '语'],
    ['hua', 'yan', 'qiao', 'yu'],
  ],
  [
    ['哗', '众', '取', '宠'],
    ['hua', 'zhong', 'qu', 'chong'],
  ],
  [
    ['化', '险', '为', '夷'],
    ['hua', 'xian', 'wei', 'yi'],
  ],
  [
    ['画', '蛇', '添', '足'],
    ['hua', 'she', 'tian', 'zu'],
  ],
  [
    ['画', '龙', '点', '睛'],
    ['hua', 'long', 'dian', 'jing'],
  ],
  [
    ['怀', '才', '不', '遇'],
    ['huai', 'cai', 'bu', 'yu'],
  ],
  [
    ['焕', '然', '一', '新'],
    ['huan', 'ran', 'yi', 'xin'],
  ],
  [
    ['浑', '然', '天', '成'],
    ['hun', 'ran', 'tian', 'cheng'],
  ],
  [
    ['集', '腋', '成', '裘'],
    ['ji', 'ye', 'cheng', 'qiu'],
  ],
  [
    ['家', '喻', '户', '晓'],
    ['jia', 'yu', 'hu', 'xiao'],
  ],
  [
    ['见', '微', '知', '著'],
    ['jian', 'wei', 'zhi', 'zhu'],
  ],
  [
    ['金', '玉', '良', '言'],
    ['jin', 'yu', 'liang', 'yan'],
  ],
  [
    ['来', '龙', '去', '脉'],
    ['lai', 'long', 'qu', 'mai'],
  ],
  [
    ['来', '日', '方', '长'],
    ['lai', 'ri', 'fang', 'chang'],
  ],
  [
    ['励', '精', '图', '治'],
    ['li', 'jing', 'tu', 'zhi'],
  ],
  [
    ['良', '辰', '吉', '日'],
    ['liang', 'chen', 'ji', 'ri'],
  ],
  [
    ['醉', '生', '梦', '死'],
    ['zui', 'sheng', 'meng', 'si'],
  ],
  [
    ['走', '马', '观', '花'],
    ['zou', 'ma', 'guan', 'hua'],
  ],
  [
    ['自', '投', '罗', '网'],
    ['zi', 'tou', 'luo', 'wang'],
  ],
  [
    ['紫', '气', '东', '来'],
    ['zi', 'qi', 'dong', 'lai'],
  ],
  [
    ['忠', '言', '逆', '耳'],
    ['zhong', 'yan', 'ni', 'er'],
  ],
  [
    ['置', '若', '罔', '闻'],
    ['zhi', 'ruo', 'wang', 'wen'],
  ],
  [
    ['志', '同', '道', '合'],
    ['zhi', 'tong', 'dao', 'he'],
  ],
  [
    ['指', '鹿', '为', '马'],
    ['zhi', 'lu', 'wei', 'ma'],
  ],
  [
    ['饮', '鸩', '止', '渴'],
    ['yin', 'zhen', 'zhi', 'ke'],
  ],
  [
    ['因', '祸', '得', '福'],
    ['yin', 'huo', 'de', 'fu'],
  ],
  [
    ['易', '如', '反', '掌'],
    ['yi', 'ru', 'fan', 'zhang'],
  ],
  [
    ['一', '视', '同', '仁'],
    ['yi', 'shi', 'tong', 'ren'],
  ],
  [
    ['一', '石', '二', '鸟'],
    ['yi', 'shi', 'er', 'niao'],
  ],
  [
    ['一', '丘', '之', '貉'],
    ['yi', 'qiu', 'zhi', 'he'],
  ],
  [
    ['一', '鸣', '惊', '人'],
    ['yi', 'ming', 'jing', 'ren'],
  ],
  [
    ['夜', '以', '继', '日'],
    ['ye', 'yi', 'ji', 'ri'],
  ],
  [
    ['咬', '文', '嚼', '字'],
    ['yao', 'wen', 'jiao', 'zi'],
  ],
  [
    ['眼', '花', '缭', '乱'],
    ['yan', 'hua', 'liao', 'luan'],
  ],
  [
    ['雅', '俗', '共', '赏'],
    ['ya', 'su', 'gong', 'shang'],
  ],
  [
    ['全', '力', '以', '赴'],
    ['quan', 'li', 'yi', 'fu'],
  ],
  [
    ['脱', '颖', '而', '出'],
    ['tuo', 'ying', 'er', 'chu'],
  ],
  [
    ['实', '事', '求', '是'],
    ['shi', 'shi', 'qiu', 'shi'],
  ],
  [
    ['一', '如', '既', '往'],
    ['yi', 'ru', 'ji', 'wang'],
  ],
  [
    ['众', '所', '周', '知'],
    ['zhong', 'suo', 'zhou', 'zhi'],
  ],
  [
    ['因', '地', '制', '宜'],
    ['yin', 'di', 'zhi', 'yi'],
  ],
  [
    ['千', '方', '百', '计'],
    ['qian', 'fang', 'bai', 'ji'],
  ],
  [
    ['息', '息', '相', '关'],
    ['xi', 'xi', 'xiang', 'guan'],
  ],
  [
    ['层', '出', '不', '穷'],
    ['ceng', 'chu', 'bu', 'qiong'],
  ],
  [
    ['引', '人', '注', '目'],
    ['yin', 'ren', 'zhu', 'mu'],
  ],
  [
    ['当', '务', '之', '急'],
    ['dang', 'wu', 'zhi', 'ji'],
  ],
  [
    ['深', '入', '人', '心'],
    ['shen', 'ru', 'ren', 'xin'],
  ],
  [
    ['见', '义', '勇', '为'],
    ['jian', 'yi', 'yong', 'wei'],
  ],
  [
    ['名', '不', '虚', '传'],
    ['ming', 'bu', 'xu', 'chuan'],
  ],
  [
    ['来', '之', '不', '易'],
    ['lai', 'zhi', 'bu', 'yi'],
  ],
  [
    ['名', '副', '其', '实'],
    ['ming', 'fu', 'qi', 'shi'],
  ],
  [
    ['下', '落', '不', '明'],
    ['xia', 'luo', 'bu', 'ming'],
  ],
  [
    ['坚', '持', '不', '懈'],
    ['jian', 'chi', 'bu', 'xie'],
  ],
  [
    ['源', '源', '不', '断'],
    ['yuan', 'yuan', 'bu', 'duan'],
  ],
  [
    ['络', '绎', '不', '绝'],
    ['luo', 'yi', 'bu', 'jue'],
  ],
  [
    ['弄', '虚', '作', '假'],
    ['nong', 'xu', 'zuo', 'jia'],
  ],
  [
    ['不', '可', '思', '议'],
    ['bu', 'ke', 'si', 'yi'],
  ],
  [
    ['小', '心', '翼', '翼'],
    ['xiao', 'xin', 'yi', 'yi'],
  ],
  [
    ['长', '治', '久', '安'],
    ['chang', 'zhi', 'jiu', 'an'],
  ],
  [
    ['如', '火', '如', '荼'],
    ['ru', 'huo', 'ru', 'tu'],
  ],
  [
    ['不', '折', '不', '扣'],
    ['bu', 'zhe', 'bu', 'kou'],
  ],
  [
    ['后', '顾', '之', '忧'],
    ['hou', 'gu', 'zhi', 'you'],
  ],
  [
    ['纸', '醉', '金', '迷'],
    ['zhi', 'zui', 'jin', 'mi'],
  ],
  [
    ['力', '所', '能', '及'],
    ['li', 'suo', 'neng', 'ji'],
  ],
  [
    ['供', '不', '应', '求'],
    ['gong', 'bu', 'ying', 'qiu'],
  ],
  [
    ['一', '目', '了', '然'],
    ['yi', 'mu', 'liao', 'ran'],
  ],
  [
    ['显', '而', '易', '见'],
    ['xian', 'er', 'yi', 'jian'],
  ],
  [
    ['安', '居', '乐', '业'],
    ['an', 'ju', 'le', 'ye'],
  ],
  [
    ['齐', '心', '协', '力'],
    ['qi', 'xin', 'xie', 'li'],
  ],
  [
    ['得', '天', '独', '厚'],
    ['de', 'tian', 'du', 'hou'],
  ],
  [
    ['一', '见', '钟', '情'],
    ['yi', 'jian', 'zhong', 'qing'],
  ],
  [
    ['独', '一', '无', '二'],
    ['du', 'yi', 'wu', 'er'],
  ],
  [
    ['不', '约', '而', '同'],
    ['bu', 'yue', 'er', 'tong'],
  ],
  [
    ['紧', '锣', '密', '鼓'],
    ['jin', 'luo', 'mi', 'gu'],
  ],
  [
    ['五', '花', '八', '门'],
    ['wu', 'hua', 'ba', 'men'],
  ],
  [
    ['一', '应', '俱', '全'],
    ['yi', 'ying', 'ju', 'quan'],
  ],
  [
    ['应', '运', '而', '生'],
    ['ying', 'yun', 'er', 'sheng'],
  ],
  [
    ['与', '众', '不', '同'],
    ['yu', 'zhong', 'bu', 'tong'],
  ],
  [
    ['触', '目', '惊', '心'],
    ['chu', 'mu', 'jing', 'xin'],
  ],
  [
    ['屡', '见', '不', '鲜'],
    ['lv', 'jian', 'bu', 'xian'],
  ],
  [
    ['无', '独', '有', '偶'],
    ['wu', 'du', 'you', 'ou'],
  ],
  [
    ['行', '之', '有', '效'],
    ['xing', 'zhi', 'you', 'xiao'],
  ],
  [
    ['大', '势', '所', '趋'],
    ['da', 'shi', 'suo', 'qu'],
  ],
  [
    ['心', '有', '余', '悸'],
    ['xin', 'you', 'yu', 'ji'],
  ],
  [
    ['不', '得', '而', '知'],
    ['bu', 'de', 'er', 'zhi'],
  ],
  [
    ['前', '所', '未', '有'],
    ['qian', 'suo', 'wei', 'you'],
  ],
  [
    ['迫', '不', '及', '待'],
    ['po', 'bu', 'ji', 'dai'],
  ],
  [
    ['雪', '上', '加', '霜'],
    ['xue', 'shang', 'jia', 'shuang'],
  ],
  [
    ['迫', '在', '眉', '睫'],
    ['po', 'zai', 'mei', 'jie'],
  ],
  [
    ['此', '起', '彼', '伏'],
    ['ci', 'qi', 'bi', 'fu'],
  ],
  [
    ['脚', '踏', '实', '地'],
    ['jiao', 'ta', 'shi', 'di'],
  ],
  [
    ['意', '想', '不', '到'],
    ['yi', 'xiang', 'bu', 'dao'],
  ],
  [
    ['错', '综', '复', '杂'],
    ['cuo', 'zong', 'fu', 'za'],
  ],
  [
    ['无', '可', '厚', '非'],
    ['wu', 'ke', 'hou', 'fei'],
  ],
  [
    ['源', '远', '流', '长'],
    ['yuan', 'yuan', 'liu', 'chang'],
  ],
  [
    ['举', '一', '反', '三'],
    ['ju', 'yi', 'fan', 'san'],
  ],
  [
    ['循', '序', '渐', '进'],
    ['xun', 'xu', 'jian', 'jin'],
  ],
  [
    ['不', '遗', '余', '力'],
    ['bu', 'yi', 'yu', 'li'],
  ],
  [
    ['不', '言', '而', '喻'],
    ['bu', 'yan', 'er', 'yu'],
  ],
  [
    ['深', '恶', '痛', '绝'],
    ['shen', 'wu', 'tong', 'jue'],
  ],
  [
    ['三', '位', '一', '体'],
    ['san', 'wei', 'yi', 'ti'],
  ],
  [
    ['截', '然', '不', '同'],
    ['jie', 'ran', 'bu', 'tong'],
  ],
  [
    ['喜', '闻', '乐', '见'],
    ['xi', 'wen', 'le', 'jian'],
  ],
  [
    ['家', '喻', '户', '晓'],
    ['jia', 'yu', 'hu', 'xiao'],
  ],
  [
    ['日', '新', '月', '异'],
    ['ri', 'xin', 'yue', 'yi'],
  ],
  [
    ['取', '而', '代', '之'],
    ['qu', 'er', 'dai', 'zhi'],
  ],
  [
    ['莫', '名', '其', '妙'],
    ['mo', 'ming', 'qi', 'miao'],
  ],
  [
    ['名', '列', '前', '茅'],
    ['ming', 'lie', 'qian', 'mao'],
  ],
  [
    ['排', '忧', '解', '难'],
    ['pai', 'you', 'jie', 'nan'],
  ],
  [
    ['玩', '忽', '职', '守'],
    ['wan', 'hu', 'zhi', 'shou'],
  ],
  [
    ['任', '重', '道', '远'],
    ['ren', 'zhong', 'dao', 'yuan'],
  ],
  [
    ['举', '足', '轻', '重'],
    ['ju', 'zu', 'qing', 'zhong'],
  ],
  [
    ['比', '比', '皆', '是'],
    ['bi', 'bi', 'jie', 'shi'],
  ],
  [
    ['卓', '有', '成', '效'],
    ['zhuo', 'you', 'cheng', 'xiao'],
  ],
  [
    ['落', '地', '生', '根'],
    ['luo', 'di', 'sheng', 'gen'],
  ],
  [
    ['势', '在', '必', '行'],
    ['shi', 'zai', 'bi', 'xing'],
  ],
  [
    ['史', '无', '前', '例'],
    ['shi', 'wu', 'qian', 'li'],
  ],
  [
    ['理', '所', '当', '然'],
    ['li', 'suo', 'dang', 'ran'],
  ],
  [
    ['耳', '熟', '能', '详'],
    ['er', 'shu', 'neng', 'xiang'],
  ],
  [
    ['铤', '而', '走', '险'],
    ['ting', 'er', 'zou', 'xian'],
  ],
  [
    ['举', '世', '瞩', '目'],
    ['ju', 'shi', 'zhu', 'mu'],
  ],
  [
    ['再', '接', '再', '厉'],
    ['zai', 'jie', 'zai', 'li'],
  ],
  [
    ['足', '不', '出', '户'],
    ['zu', 'bu', 'chu', 'hu'],
  ],
  [
    ['翻', '天', '覆', '地'],
    ['fan', 'tian', 'fu', 'di'],
  ],
  [
    ['不', '翼', '而', '飞'],
    ['bu', 'yi', 'er', 'fei'],
  ],
  [
    ['参', '差', '不', '齐'],
    ['can', 'ci', 'bu', 'qi'],
  ],
  [
    ['水', '涨', '船', '高'],
    ['shui', 'zhang', 'chuan', 'gao'],
  ],
  [
    ['先', '发', '制', '人'],
    ['xian', 'fa', 'zhi', 'ren'],
  ],
  [
    ['轩', '然', '大', '波'],
    ['xuan', 'ran', 'da', 'bo'],
  ],
  [
    ['统', '筹', '兼', '顾'],
    ['tong', 'chou', 'jian', 'gu'],
  ],
  [
    ['明', '察', '暗', '访'],
    ['ming', 'cha', 'an', 'fang'],
  ],
  [
    ['刻', '不', '容', '缓'],
    ['ke', 'bu', 'rong', 'huan'],
  ],
  [
    ['融', '为', '一', '体'],
    ['rong', 'wei', 'yi', 'ti'],
  ],
  [
    ['焕', '然', '一', '新'],
    ['huan', 'ran', 'yi', 'xin'],
  ],
  [
    ['以', '身', '作', '则'],
    ['yi', 'shen', 'zuo', 'ze'],
  ],
  [
    ['潜', '移', '默', '化'],
    ['qian', 'yi', 'mo', 'hua'],
  ],
  [
    ['风', '口', '浪', '尖'],
    ['feng', 'kou', 'lang', 'jian'],
  ],
  [
    ['有', '条', '不', '紊'],
    ['you', 'tiao', 'bu', 'wen'],
  ],
  [
    ['归', '根', '结', '底'],
    ['gui', 'gen', 'jie', 'di'],
  ],
  [
    ['发', '扬', '光', '大'],
    ['fa', 'yang', 'guang', 'da'],
  ],
  [
    ['旗', '帜', '鲜', '明'],
    ['qi', 'zhi', 'xian', 'ming'],
  ],
  [
    ['万', '无', '一', '失'],
    ['wan', 'wu', 'yi', 'shi'],
  ],
  [
    ['可', '见', '一', '斑'],
    ['ke', 'jian', 'yi', 'ban'],
  ],
  [
    ['一', '视', '同', '仁'],
    ['yi', 'shi', 'tong', 'ren'],
  ],
  [
    ['相', '辅', '相', '成'],
    ['xiang', 'fu', 'xiang', 'cheng'],
  ],
  [
    ['淋', '漓', '尽', '致'],
    ['lin', 'li', 'jin', 'zhi'],
  ],
  [
    ['耳', '目', '一', '新'],
    ['er', 'mu', 'yi', 'xin'],
  ],
  [
    ['不', '了', '了', '之'],
    ['bu', 'liao', 'liao', 'zhi'],
  ],
  [
    ['热', '火', '朝', '天'],
    ['re', 'huo', 'chao', 'tian'],
  ],
  [
    ['有', '目', '共', '睹'],
    ['you', 'mu', 'gong', 'du'],
  ],
  [
    ['久', '而', '久', '之'],
    ['jiu', 'er', 'jiu', 'zhi'],
  ],
  [
    ['视', '而', '不', '见'],
    ['shi', 'er', 'bu', 'jian'],
  ],
  [
    ['自', '强', '不', '息'],
    ['zi', 'qiang', 'bu', 'xi'],
  ],
  [
    ['以', '权', '谋', '私'],
    ['yi', 'quan', 'mou', 'si'],
  ],
  [
    ['继', '往', '开', '来'],
    ['ji', 'wang', 'kai', 'lai'],
  ],
  [
    ['赞', '不', '绝', '口'],
    ['zan', 'bu', 'jue', 'kou'],
  ],
  [
    ['义', '不', '容', '辞'],
    ['yi', 'bu', 'rong', 'ci'],
  ],
  [
    ['未', '雨', '绸', '缪'],
    ['wei', 'yu', 'chou', 'mou'],
  ],
  [
    ['绳', '之', '以', '法'],
    ['sheng', 'zhi', 'yi', 'fa'],
  ],
  [
    ['对', '症', '下', '药'],
    ['dui', 'zheng', 'xia', 'yao'],
  ],
  [
    ['出', '谋', '划', '策'],
    ['chu', 'mou', 'hua', 'ce'],
  ],
  [
    ['首', '当', '其', '冲'],
    ['shou', 'dang', 'qi', 'chong'],
  ],
  [
    ['马', '不', '停', '蹄'],
    ['ma', 'bu', 'ting', 'ti'],
  ],
  [
    ['不', '以', '为', '然'],
    ['bu', 'yi', 'wei', 'ran'],
  ],
  [
    ['一', '蹴', '而', '就'],
    ['yi', 'cu', 'er', 'jiu'],
  ],
  [
    ['人', '满', '为', '患'],
    ['ren', 'man', 'wei', 'huan'],
  ],
  [
    ['身', '体', '力', '行'],
    ['shen', 'ti', 'li', 'xing'],
  ],
  [
    ['精', '益', '求', '精'],
    ['jing', 'yi', 'qiu', 'jing'],
  ],
  [
    ['竭', '尽', '全', '力'],
    ['jie', 'jin', 'quan', 'li'],
  ],
  [
    ['拭', '目', '以', '待'],
    ['shi', 'mu', 'yi', 'dai'],
  ],
  [
    ['无', '家', '可', '归'],
    ['wu', 'jia', 'ke', 'gui'],
  ],
  [
    ['哭', '笑', '不', '得'],
    ['ku', 'xiao', 'bu', 'de'],
  ],
  [
    ['不', '知', '所', '措'],
    ['bu', 'zhi', 'suo', 'cuo'],
  ],
  [
    ['座', '无', '虚', '席'],
    ['zuo', 'wu', 'xu', 'xi'],
  ],
  [
    ['可', '乘', '之', '机'],
    ['ke', 'cheng', 'zhi', 'ji'],
  ],
  [
    ['琳', '琅', '满', '目'],
    ['lin', 'lang', 'man', 'mu'],
  ],
  [
    ['卷', '土', '重', '来'],
    ['juan', 'tu', 'chong', 'lai'],
  ],
  [
    ['铺', '天', '盖', '地'],
    ['pu', 'tian', 'gai', 'di'],
  ],
  [
    ['理', '直', '气', '壮'],
    ['li', 'zhi', 'qi', 'zhuang'],
  ],
  [
    ['面', '目', '全', '非'],
    ['mian', 'mu', 'quan', 'fei'],
  ],
  [
    ['忧', '心', '忡', '忡'],
    ['you', 'xin', 'chong', 'chong'],
  ],
  [
    ['在', '所', '难', '免'],
    ['zai', 'suo', 'nan', 'mian'],
  ],
  [
    ['燃', '眉', '之', '急'],
    ['ran', 'mei', 'zhi', 'ji'],
  ],
  [
    ['图', '文', '并', '茂'],
    ['tu', 'wen', 'bing', 'mao'],
  ],
  [
    ['不', '绝', '于', '耳'],
    ['bu', 'jue', 'yu', 'er'],
  ],
  [
    ['津', '津', '乐', '道'],
    ['jin', 'jin', 'le', 'dao'],
  ],
  [
    ['立', '竿', '见', '影'],
    ['li', 'gan', 'jian', 'ying'],
  ],
  [
    ['与', '日', '俱', '增'],
    ['yu', 'ri', 'ju', 'zeng'],
  ],
  [
    ['精', '心', '设', '计'],
    ['jing', 'xin', 'she', 'ji'],
  ],
  [
    ['急', '功', '近', '利'],
    ['ji', 'gong', 'jin', 'li'],
  ],
  [
    ['鲜', '为', '人', '知'],
    ['xian', 'wei', 'ren', 'zhi'],
  ],
  [
    ['根', '深', '蒂', '固'],
    ['gen', 'shen', 'di', 'gu'],
  ],
  [
    ['博', '大', '精', '深'],
    ['bo', 'da', 'jing', 'shen'],
  ],
  [
    ['大', '有', '可', '为'],
    ['da', 'you', 'ke', 'wei'],
  ],
  [
    ['惊', '心', '动', '魄'],
    ['jing', 'xin', 'dong', 'po'],
  ],
  [
    ['不', '亦', '乐', '乎'],
    ['bu', 'yi', 'le', 'hu'],
  ],
  [
    ['相', '得', '益', '彰'],
    ['xiang', 'de', 'yi', 'zhang'],
  ],
  [
    ['耐', '人', '寻', '味'],
    ['nai', 'ren', 'xun', 'wei'],
  ],
  [
    ['别', '开', '生', '面'],
    ['bie', 'kai', 'sheng', 'mian'],
  ],
  [
    ['水', '泄', '不', '通'],
    ['shui', 'xie', 'bu', 'tong'],
  ],
  [
    ['接', '二', '连', '三'],
    ['jie', 'er', 'lian', 'san'],
  ],
  [
    ['无', '能', '为', '力'],
    ['wu', 'neng', 'wei', 'li'],
  ],
  [
    ['难', '以', '为', '继'],
    ['nan', 'yi', 'wei', 'ji'],
  ],
  [
    ['陷', '入', '僵', '局'],
    ['xian', 'ru', 'jiang', 'ju'],
  ],
  [
    ['感', '同', '身', '受'],
    ['gan', 'tong', 'shen', 'shou'],
  ],
  [
    ['匪', '夷', '所', '思'],
    ['fei', 'yi', 'suo', 'si'],
  ],
  [
    ['背', '道', '而', '驰'],
    ['bei', 'dao', 'er', 'chi'],
  ],
  [
    ['难', '以', '置', '信'],
    ['nan', 'yi', 'zhi', 'xin'],
  ],
  [
    ['一', '帆', '风', '顺'],
    ['yi', 'fan', 'feng', 'shun'],
  ],
  [
    ['掉', '以', '轻', '心'],
    ['diao', 'yi', 'qing', 'xin'],
  ],
  [
    ['畅', '所', '欲', '言'],
    ['chang', 'suo', 'yu', 'yan'],
  ],
  [
    ['习', '以', '为', '常'],
    ['xi', 'yi', 'wei', 'chang'],
  ],
  [
    ['漏', '洞', '百', '出'],
    ['lou', 'dong', 'bai', 'chu'],
  ],
  [
    ['年', '久', '失', '修'],
    ['nian', 'jiu', 'shi', 'xiu'],
  ],
  [
    ['一', '脉', '相', '承'],
    ['yi', 'mai', 'xiang', 'cheng'],
  ],
  [
    ['当', '之', '无', '愧'],
    ['dang', 'zhi', 'wu', 'kui'],
  ],
  [
    ['肆', '无', '忌', '惮'],
    ['si', 'wu', 'ji', 'dan'],
  ],
  [
    ['寥', '寥', '无', '几'],
    ['liao', 'liao', 'wu', 'ji'],
  ],
  [
    ['顺', '藤', '摸', '瓜'],
    ['shun', 'teng', 'mo', 'gua'],
  ],
  [
    ['助', '人', '为', '乐'],
    ['zhu', 'ren', 'wei', 'le'],
  ],
  [
    ['欢', '聚', '一', '堂'],
    ['huan', 'ju', 'yi', 'tang'],
  ],
  [
    ['泪', '流', '满', '面'],
    ['lei', 'liu', 'man', 'mian'],
  ],
  [
    ['接', '踵', '而', '至'],
    ['jie', 'zhong', 'er', 'zhi'],
  ],
  [
    ['直', '言', '不', '讳'],
    ['zhi', 'yan', 'bu', 'hui'],
  ],
  [
    ['义', '无', '反', '顾'],
    ['yi', 'wu', 'fan', 'gu'],
  ],
  [
    ['力', '不', '从', '心'],
    ['li', 'bu', 'cong', 'xin'],
  ],
  [
    ['慕', '名', '而', '来'],
    ['mu', 'ming', 'er', 'lai'],
  ],
  [
    ['纷', '至', '沓', '来'],
    ['fen', 'zhi', 'ta', 'lai'],
  ],
  [
    ['兴', '致', '勃', '勃'],
    ['xing', 'zhi', 'bo', 'bo'],
  ],
  [
    ['家', '常', '便', '饭'],
    ['jia', 'chang', 'bian', 'fan'],
  ],
  [
    ['措', '手', '不', '及'],
    ['cuo', 'shou', 'bu', 'ji'],
  ],
  [
    ['心', '急', '如', '焚'],
    ['xin', 'ji', 'ru', 'fen'],
  ],
  [
    ['一', '席', '之', '地'],
    ['yi', 'xi', 'zhi', 'di'],
  ],
  [
    ['栩', '栩', '如', '生'],
    ['xu', 'xu', 'ru', 'sheng'],
  ],
  [
    ['眼', '花', '缭', '乱'],
    ['yan', 'hua', 'liao', 'luan'],
  ],
  [
    ['雪', '中', '送', '炭'],
    ['xue', 'zhong', 'song', 'tan'],
  ],
  [
    ['得', '不', '偿', '失'],
    ['de', 'bu', 'chang', 'shi'],
  ],
  [
    ['安', '然', '无', '恙'],
    ['an', 'ran', 'wu', 'yang'],
  ],
  [
    ['深', '入', '浅', '出'],
    ['shen', 'ru', 'qian', 'chu'],
  ],
  [
    ['捉', '襟', '见', '肘'],
    ['zhuo', 'jin', 'jian', 'zhou'],
  ],
  [
    ['拒', '之', '门', '外'],
    ['ju', 'zhi', 'men', 'wai'],
  ],
  [
    ['望', '而', '却', '步'],
    ['wang', 'er', 'que', 'bu'],
  ],
  [
    ['默', '默', '无', '闻'],
    ['mo', 'mo', 'wu', 'wen'],
  ],
  [
    ['顺', '理', '成', '章'],
    ['shun', 'li', 'cheng', 'zhang'],
  ],
  [
    ['难', '能', '可', '贵'],
    ['nan', 'neng', 'ke', 'gui'],
  ],
  [
    ['来', '龙', '去', '脉'],
    ['lai', 'long', 'qu', 'mai'],
  ],
  [
    ['不', '谋', '而', '合'],
    ['bu', 'mou', 'er', 'he'],
  ],
  [
    ['如', '出', '一', '辙'],
    ['ru', 'chu', 'yi', 'zhe'],
  ],
  [
    ['提', '心', '吊', '胆'],
    ['ti', 'xin', 'diao', 'dan'],
  ],
  [
    ['徇', '私', '舞', '弊'],
    ['xun', 'si', 'wu', 'bi'],
  ],
  [
    ['一', '无', '所', '知'],
    ['yi', 'wu', 'suo', 'zhi'],
  ],
  [
    ['别', '有', '用', '心'],
    ['bie', 'you', 'yong', 'xin'],
  ],
  [
    ['大', '打', '出', '手'],
    ['da', 'da', 'chu', 'shou'],
  ],
  [
    ['同', '舟', '共', '济'],
    ['tong', 'zhou', 'gong', 'ji'],
  ],
  [
    ['雨', '后', '春', '笋'],
    ['yu', 'hou', 'chun', 'sun'],
  ],
  [
    ['兢', '兢', '业', '业'],
    ['jing', 'jing', 'ye', 'ye'],
  ],
  [
    ['泣', '不', '成', '声'],
    ['qi', 'bu', 'cheng', 'sheng'],
  ],
  [
    ['无', '人', '问', '津'],
    ['wu', 'ren', 'wen', 'jin'],
  ],
  [
    ['应', '有', '尽', '有'],
    ['ying', 'you', 'jin', 'you'],
  ],
  [
    ['引', '以', '为', '戒'],
    ['yin', 'yi', 'wei', 'jie'],
  ],
  [
    ['异', '军', '突', '起'],
    ['yi', 'jun', 'tu', 'qi'],
  ],
  [
    ['通', '俗', '易', '懂'],
    ['tong', 'su', 'yi', 'dong'],
  ],
  [
    ['波', '澜', '壮', '阔'],
    ['bo', 'lan', 'zhuang', 'kuo'],
  ],
  [
    ['无', '可', '奈', '何'],
    ['wu', 'ke', 'nai', 'he'],
  ],
  [
    ['品', '学', '兼', '优'],
    ['pin', 'xue', 'jian', 'you'],
  ],
  [
    ['司', '空', '见', '惯'],
    ['si', 'kong', 'jian', 'guan'],
  ],
  [
    ['推', '波', '助', '澜'],
    ['tui', 'bo', 'zhu', 'lan'],
  ],
  [
    ['微', '乎', '其', '微'],
    ['wei', 'hu', 'qi', 'wei'],
  ],
  [
    ['相', '提', '并', '论'],
    ['xiang', 'ti', 'bing', 'lun'],
  ],
  [
    ['束', '手', '无', '策'],
    ['shu', 'shou', 'wu', 'ce'],
  ],
  [
    ['信', '以', '为', '真'],
    ['xin', 'yi', 'wei', 'zhen'],
  ],
  [
    ['死', '灰', '复', '燃'],
    ['si', 'hui', 'fu', 'ran'],
  ],
  [
    ['苦', '不', '堪', '言'],
    ['ku', 'bu', 'kan', 'yan'],
  ],
  [
    ['争', '分', '夺', '秒'],
    ['zheng', 'fen', 'duo', 'miao'],
  ],
  [
    ['集', '思', '广', '益'],
    ['ji', 'si', 'guang', 'yi'],
  ],
  [
    ['自', '力', '更', '生'],
    ['zi', 'li', 'geng', 'sheng'],
  ],
  [
    ['有', '的', '放', '矢'],
    ['you', 'di', 'fang', 'shi'],
  ],
  [
    ['严', '阵', '以', '待'],
    ['yan', 'zhen', 'yi', 'dai'],
  ],
  [
    ['建', '功', '立', '业'],
    ['jian', 'gong', 'li', 'ye'],
  ],
  [
    ['溃', '不', '成', '军'],
    ['kui', 'bu', 'cheng', 'jun'],
  ],
  [
    ['年', '事', '已', '高'],
    ['nian', 'shi', 'yi', 'gao'],
  ],
  [
    ['绿', '水', '青', '山'],
    ['lv', 'shui', 'qing', 'shan'],
  ],
  [
    ['半', '壁', '江', '山'],
    ['ban', 'bi', 'jiang', 'shan'],
  ],
  [
    ['求', '同', '存', '异'],
    ['qiu', 'tong', 'cun', 'yi'],
  ],
  [
    ['蛛', '丝', '马', '迹'],
    ['zhu', 'si', 'ma', 'ji'],
  ],
  [
    ['鱼', '龙', '混', '杂'],
    ['yu', 'long', 'hun', 'za'],
  ],
  [
    ['扑', '朔', '迷', '离'],
    ['pu', 'shuo', 'mi', 'li'],
  ],
  [
    ['熙', '熙', '攘', '攘'],
    ['xi', 'xi', 'rang', 'rang'],
  ],
  [
    ['一', '技', '之', '长'],
    ['yi', 'ji', 'zhi', 'chang'],
  ],
  [
    ['大', '江', '南', '北'],
    ['da', 'jiang', 'nan', 'bei'],
  ],
  [
    ['屈', '指', '可', '数'],
    ['qu', 'zhi', 'ke', 'shu'],
  ],
  [
    ['交', '相', '辉', '映'],
    ['jiao', 'xiang', 'hui', 'ying'],
  ],
  [
    ['公', '之', '于', '众'],
    ['gong', 'zhi', 'yu', 'zhong'],
  ],
  [
    ['一', '拍', '即', '合'],
    ['yi', 'pai', 'ji', 'he'],
  ],
  [
    ['一', '丝', '不', '苟'],
    ['yi', 'si', 'bu', 'gou'],
  ],
  [
    ['相', '依', '为', '命'],
    ['xiang', 'yi', 'wei', 'ming'],
  ],
  [
    ['微', '不', '足', '道'],
    ['wei', 'bu', 'zu', 'dao'],
  ],
  [
    ['良', '莠', '不', '齐'],
    ['liang', 'you', 'bu', 'qi'],
  ],
  [
    ['迎', '刃', '而', '解'],
    ['ying', 'ren', 'er', 'jie'],
  ],
  [
    ['从', '天', '而', '降'],
    ['cong', 'tian', 'er', 'jiang'],
  ],
  [
    ['不', '合', '时', '宜'],
    ['bu', 'he', 'shi', 'yi'],
  ],
  [
    ['受', '益', '匪', '浅'],
    ['shou', 'yi', 'fei', 'qian'],
  ],
  [
    ['新', '陈', '代', '谢'],
    ['xin', 'chen', 'dai', 'xie'],
  ],
  [
    ['高', '高', '在', '上'],
    ['gao', 'gao', 'zai', 'shang'],
  ],
  [
    ['量', '力', '而', '行'],
    ['liang', 'li', 'er', 'xing'],
  ],
  [
    ['不', '切', '实', '际'],
    ['bu', 'qie', 'shi', 'ji'],
  ],
  [
    ['针', '锋', '相', '对'],
    ['zhen', 'feng', 'xiang', 'dui'],
  ],
  [
    ['责', '无', '旁', '贷'],
    ['ze', 'wu', 'pang', 'dai'],
  ],
  [
    ['高', '瞻', '远', '瞩'],
    ['gao', 'zhan', 'yuan', 'zhu'],
  ],
  [
    ['明', '目', '张', '胆'],
    ['ming', 'mu', 'zhang', 'dan'],
  ],
  [
    ['适', '得', '其', '反'],
    ['shi', 'de', 'qi', 'fan'],
  ],
  [
    ['跃', '跃', '欲', '试'],
    ['yue', 'yue', 'yu', 'shi'],
  ],
  [
    ['聚', '精', '会', '神'],
    ['ju', 'jing', 'hui', 'shen'],
  ],
  [
    ['承', '前', '启', '后'],
    ['cheng', 'qian', 'qi', 'hou'],
  ],
  [
    ['杯', '水', '车', '薪'],
    ['bei', 'shui', 'che', 'xin'],
  ],
  [
    ['一', '网', '打', '尽'],
    ['yi', 'wang', 'da', 'jin'],
  ],
  [
    ['慷', '慨', '解', '囊'],
    ['kang', 'kai', 'jie', 'nang'],
  ],
  [
    ['素', '不', '相', '识'],
    ['su', 'bu', 'xiang', 'shi'],
  ],
  [
    ['长', '此', '以', '往'],
    ['chang', 'ci', 'yi', 'wang'],
  ],
  [
    ['格', '格', '不', '入'],
    ['ge', 'ge', 'bu', 'ru'],
  ],
  [
    ['蔚', '然', '成', '风'],
    ['wei', 'ran', 'cheng', 'feng'],
  ],
  [
    ['生', '机', '勃', '勃'],
    ['sheng', 'ji', 'bo', 'bo'],
  ],
  [
    ['大', '相', '径', '庭'],
    ['da', 'xiang', 'jing', 'ting'],
  ],
  [
    ['堂', '而', '皇', '之'],
    ['tang', 'er', 'huang', 'zhi'],
  ],
  [
    ['如', '数', '家', '珍'],
    ['ru', 'shu', 'jia', 'zhen'],
  ],
  [
    ['更', '新', '换', '代'],
    ['geng', 'xin', 'huan', 'dai'],
  ],
  [
    ['争', '先', '恐', '后'],
    ['zheng', 'xian', 'kong', 'hou'],
  ],
  [
    ['浓', '墨', '重', '彩'],
    ['nong', 'mo', 'zhong', 'cai'],
  ],
  [
    ['大', '刀', '阔', '斧'],
    ['da', 'dao', 'kuo', 'fu'],
  ],
  [
    ['惊', '慌', '失', '措'],
    ['jing', 'huang', 'shi', 'cuo'],
  ],
  [
    ['所', '剩', '无', '几'],
    ['suo', 'sheng', 'wu', 'ji'],
  ],
  [
    ['高', '官', '厚', '禄'],
    ['gao', 'guan', 'hou', 'lu'],
  ],
  [
    ['井', '然', '有', '序'],
    ['jing', 'ran', 'you', 'xu'],
  ],
  [
    ['一', '波', '三', '折'],
    ['yi', 'bo', 'san', 'zhe'],
  ],
  [
    ['形', '迹', '可', '疑'],
    ['xing', 'ji', 'ke', 'yi'],
  ],
  [
    ['炙', '手', '可', '热'],
    ['zhi', 'shou', 'ke', 're'],
  ],
  [
    ['身', '临', '其', '境'],
    ['shen', 'lin', 'qi', 'jing'],
  ],
  [
    ['二', '话', '不', '说'],
    ['er', 'hua', 'bu', 'shuo'],
  ],
  [
    ['流', '连', '忘', '返'],
    ['liu', 'lian', 'wang', 'fan'],
  ],
  [
    ['热', '泪', '盈', '眶'],
    ['re', 'lei', 'ying', 'kuang'],
  ],
  [
    ['销', '声', '匿', '迹'],
    ['xiao', 'sheng', 'ni', 'ji'],
  ],
  [
    ['一', '以', '贯', '之'],
    ['yi', 'yi', 'guan', 'zhi'],
  ],
  [
    ['恍', '然', '大', '悟'],
    ['huang', 'ran', 'da', 'wu'],
  ],
  [
    ['置', '之', '不', '理'],
    ['zhi', 'zhi', 'bu', 'li'],
  ],
  [
    ['轻', '而', '易', '举'],
    ['qing', 'er', 'yi', 'ju'],
  ],
  [
    ['人', '来', '人', '往'],
    ['ren', 'lai', 'ren', 'wang'],
  ],
  [
    ['青', '山', '绿', '水'],
    ['qing', 'shan', 'lv', 'shui'],
  ],
  [
    ['齐', '头', '并', '进'],
    ['qi', 'tou', 'bing', 'jin'],
  ],
  [
    ['一', '筹', '莫', '展'],
    ['yi', 'chou', 'mo', 'zhan'],
  ],
  [
    ['百', '花', '齐', '放'],
    ['bai', 'hua', 'qi', 'fang'],
  ],
  [
    ['各', '执', '一', '词'],
    ['ge', 'zhi', 'yi', 'ci'],
  ],
  [
    ['志', '同', '道', '合'],
    ['zhi', 'tong', 'dao', 'he'],
  ],
  [
    ['绞', '尽', '脑', '汁'],
    ['jiao', 'jin', 'nao', 'zhi'],
  ],
  [
    ['首', '屈', '一', '指'],
    ['shou', 'qu', 'yi', 'zhi'],
  ],
  [
    ['水', '到', '渠', '成'],
    ['shui', 'dao', 'qu', 'cheng'],
  ],
  [
    ['物', '美', '价', '廉'],
    ['wu', 'mei', 'jia', 'lian'],
  ],
  [
    ['众', '说', '纷', '纭'],
    ['zhong', 'shuo', 'fen', 'yun'],
  ],
  [
    ['各', '自', '为', '政'],
    ['ge', 'zi', 'wei', 'zheng'],
  ],
  [
    ['语', '重', '心', '长'],
    ['yu', 'zhong', 'xin', 'chang'],
  ],
  [
    ['德', '才', '兼', '备'],
    ['de', 'cai', 'jian', 'bei'],
  ],
  [
    ['乐', '此', '不', '疲'],
    ['le', 'ci', 'bu', 'pi'],
  ],
  [
    ['五', '颜', '六', '色'],
    ['wu', 'yan', 'liu', 'se'],
  ],
  [
    ['无', '动', '于', '衷'],
    ['wu', 'dong', 'yu', 'zhong'],
  ],
  [
    ['锦', '上', '添', '花'],
    ['jin', 'shang', 'tian', 'hua'],
  ],
  [
    ['荒', '淫', '无', '度'],
    ['huang', 'yin', 'wu', 'du'],
  ],
  [
    ['推', '陈', '出', '新'],
    ['tui', 'chen', 'chu', 'xin'],
  ],
  [
    ['独', '树', '一', '帜'],
    ['du', 'shu', 'yi', 'zhi'],
  ],
  [
    ['省', '吃', '俭', '用'],
    ['sheng', 'chi', 'jian', 'yong'],
  ],
  [
    ['无', '济', '于', '事'],
    ['wu', 'ji', 'yu', 'shi'],
  ],
  [
    ['情', '不', '自', '禁'],
    ['qing', 'bu', 'zi', 'jin'],
  ],
  [
    ['不', '足', '为', '奇'],
    ['bu', 'zu', 'wei', 'qi'],
  ],
  [
    ['忍', '无', '可', '忍'],
    ['ren', 'wu', 'ke', 'ren'],
  ],
  [
    ['郁', '郁', '葱', '葱'],
    ['yu', 'yu', 'cong', 'cong'],
  ],
  [
    ['事', '半', '功', '倍'],
    ['shi', 'ban', 'gong', 'bei'],
  ],
  [
    ['分', '门', '别', '类'],
    ['fen', 'men', 'bie', 'lei'],
  ],
  [
    ['别', '出', '心', '裁'],
    ['bie', 'chu', 'xin', 'cai'],
  ],
  [
    ['大', '张', '旗', '鼓'],
    ['da', 'zhang', 'qi', 'gu'],
  ],
  [
    ['防', '不', '胜', '防'],
    ['fang', 'bu', 'sheng', 'fang'],
  ],
  [
    ['惊', '魂', '未', '定'],
    ['jing', 'hun', 'wei', 'ding'],
  ],
  [
    ['蒙', '混', '过', '关'],
    ['meng', 'hun', 'guo', 'guan'],
  ],
  [
    ['错', '落', '有', '致'],
    ['cuo', 'luo', 'you', 'zhi'],
  ],
  [
    ['入', '不', '敷', '出'],
    ['ru', 'bu', 'fu', 'chu'],
  ],
  [
    ['我', '行', '我', '素'],
    ['wo', 'xing', 'wo', 'su'],
  ],
  [
    ['深', '思', '熟', '虑'],
    ['shen', 'si', 'shu', 'lv'],
  ],
  [
    ['趋', '之', '若', '鹜'],
    ['qu', 'zhi', 'ruo', 'wu'],
  ],
  [
    ['无', '微', '不', '至'],
    ['wu', 'wei', 'bu', 'zhi'],
  ],
  [
    ['车', '水', '马', '龙'],
    ['che', 'shui', 'ma', 'long'],
  ],
  [
    ['无', '所', '适', '从'],
    ['wu', 'suo', 'shi', 'cong'],
  ],
  [
    ['变', '本', '加', '厉'],
    ['bian', 'ben', 'jia', 'li'],
  ],
  [
    ['壮', '士', '断', '腕'],
    ['zhuang', 'shi', 'duan', 'wan'],
  ],
  [
    ['雄', '心', '勃', '勃'],
    ['xiong', 'xin', 'bo', 'bo'],
  ],
  [
    ['学', '以', '致', '用'],
    ['xue', 'yi', 'zhi', 'yong'],
  ],
  [
    ['五', '湖', '四', '海'],
    ['wu', 'hu', 'si', 'hai'],
  ],
  [
    ['审', '时', '度', '势'],
    ['shen', 'shi', 'du', 'shi'],
  ],
  [
    ['不', '择', '手', '段'],
    ['bu', 'ze', 'shou', 'duan'],
  ],
  [
    ['大', '起', '大', '落'],
    ['da', 'qi', 'da', 'luo'],
  ],
  [
    ['不', '厌', '其', '烦'],
    ['bu', 'yan', 'qi', 'fan'],
  ],
  [
    ['四', '通', '八', '达'],
    ['si', 'tong', 'ba', 'da'],
  ],
  [
    ['不', '可', '开', '交'],
    ['bu', 'ke', 'kai', 'jiao'],
  ],
  [
    ['春', '暖', '花', '开'],
    ['chun', 'nuan', 'hua', 'kai'],
  ],
  [
    ['天', '经', '地', '义'],
    ['tian', 'jing', 'di', 'yi'],
  ],
  [
    ['悬', '而', '未', '决'],
    ['xuan', 'er', 'wei', 'jue'],
  ],
  [
    ['一', '言', '不', '发'],
    ['yi', 'yan', 'bu', 'fa'],
  ],
  [
    ['蜂', '拥', '而', '至'],
    ['feng', 'yong', 'er', 'zhi'],
  ],
  [
    ['扬', '长', '而', '去'],
    ['yang', 'chang', 'er', 'qu'],
  ],
  [
    ['水', '落', '石', '出'],
    ['shui', 'luo', 'shi', 'chu'],
  ],
  [
    ['大', '开', '眼', '界'],
    ['da', 'kai', 'yan', 'jie'],
  ],
  [
    ['载', '歌', '载', '舞'],
    ['zai', 'ge', 'zai', 'wu'],
  ],
  [
    ['子', '虚', '乌', '有'],
    ['zi', 'xu', 'wu', 'you'],
  ],
  [
    ['了', '如', '指', '掌'],
    ['liao', 'ru', 'zhi', 'zhang'],
  ],
  [
    ['历', '历', '在', '目'],
    ['li', 'li', 'zai', 'mu'],
  ],
  [
    ['徇', '私', '枉', '法'],
    ['xun', 'si', 'wang', 'fa'],
  ],
  [
    ['风', '云', '变', '幻'],
    ['feng', 'yun', 'bian', 'huan'],
  ],
  [
    ['公', '正', '廉', '洁'],
    ['gong', 'zheng', 'lian', 'jie'],
  ],
  [
    ['千', '丝', '万', '缕'],
    ['qian', 'si', 'wan', 'lv'],
  ],
  [
    ['奋', '不', '顾', '身'],
    ['fen', 'bu', 'gu', 'shen'],
  ],
  [
    ['轻', '描', '淡', '写'],
    ['qing', 'miao', 'dan', 'xie'],
  ],
  [
    ['不', '解', '之', '缘'],
    ['bu', 'jie', 'zhi', 'yuan'],
  ],
  [
    ['顾', '名', '思', '义'],
    ['gu', 'ming', 'si', 'yi'],
  ],
  [
    ['有', '声', '有', '色'],
    ['you', 'sheng', 'you', 'se'],
  ],
  [
    ['流', '离', '失', '所'],
    ['liu', 'li', 'shi', 'suo'],
  ],
  [
    ['诸', '如', '此', '类'],
    ['zhu', 'ru', 'ci', 'lei'],
  ],
  [
    ['一', '清', '二', '楚'],
    ['yi', 'qing', 'er', 'chu'],
  ],
  [
    ['众', '志', '成', '城'],
    ['zhong', 'zhi', 'cheng', 'cheng'],
  ],
  [
    ['救', '死', '扶', '伤'],
    ['jiu', 'si', 'fu', 'shang'],
  ],
  [
    ['梦', '寐', '以', '求'],
    ['meng', 'mei', 'yi', 'qiu'],
  ],
  [
    ['逍', '遥', '法', '外'],
    ['xiao', 'yao', 'fa', 'wai'],
  ],
  [
    ['信', '誓', '旦', '旦'],
    ['xin', 'shi', 'dan', 'dan'],
  ],
  [
    ['不', '计', '其', '数'],
    ['bu', 'ji', 'qi', 'shu'],
  ],
  [
    ['缺', '一', '不', '可'],
    ['que', 'yi', 'bu', 'ke'],
  ],
  [
    ['脱', '胎', '换', '骨'],
    ['tuo', 'tai', 'huan', 'gu'],
  ],
  [
    ['真', '心', '实', '意'],
    ['zhen', 'xin', 'shi', 'yi'],
  ],
  [
    ['对', '簿', '公', '堂'],
    ['dui', 'bu', 'gong', 'tang'],
  ],
  [
    ['不', '辱', '使', '命'],
    ['bu', 'ru', 'shi', 'ming'],
  ],
  [
    ['狂', '风', '暴', '雨'],
    ['kuang', 'feng', 'bao', 'yu'],
  ],
  [
    ['日', '复', '一', '日'],
    ['ri', 'fu', 'yi', 'ri'],
  ],
  [
    ['白', '发', '苍', '苍'],
    ['bai', 'fa', 'cang', 'cang'],
  ],
  [
    ['山', '清', '水', '秀'],
    ['shan', 'qing', 'shui', 'xiu'],
  ],
  [
    ['随', '心', '所', '欲'],
    ['sui', 'xin', 'suo', 'yu'],
  ],
  [
    ['不', '堪', '设', '想'],
    ['bu', 'kan', 'she', 'xiang'],
  ],
  [
    ['叹', '为', '观', '止'],
    ['tan', 'wei', 'guan', 'zhi'],
  ],
  [
    ['不', '由', '自', '主'],
    ['bu', 'you', 'zi', 'zhu'],
  ],
  [
    ['如', '愿', '以', '偿'],
    ['ru', 'yuan', 'yi', 'chang'],
  ],
  [
    ['取', '长', '补', '短'],
    ['qu', 'chang', 'bu', 'duan'],
  ],
  [
    ['近', '在', '咫', '尺'],
    ['jin', 'zai', 'zhi', 'chi'],
  ],
  [
    ['惨', '不', '忍', '睹'],
    ['can', 'bu', 'ren', 'du'],
  ],
  [
    ['一', '无', '所', '获'],
    ['yi', 'wu', 'suo', 'huo'],
  ],
  [
    ['呼', '之', '欲', '出'],
    ['hu', 'zhi', 'yu', 'chu'],
  ],
  [
    ['一', '厢', '情', '愿'],
    ['yi', 'xiang', 'qing', 'yuan'],
  ],
  [
    ['无', '与', '伦', '比'],
    ['wu', 'yu', 'lun', 'bi'],
  ],
  [
    ['无', '中', '生', '有'],
    ['wu', 'zhong', 'sheng', 'you'],
  ],
  [
    ['轰', '动', '一', '时'],
    ['hong', 'dong', 'yi', 'shi'],
  ],
  [
    ['街', '头', '巷', '尾'],
    ['jie', 'tou', 'xiang', 'wei'],
  ],
  [
    ['掷', '地', '有', '声'],
    ['zhi', 'di', 'you', 'sheng'],
  ],
  [
    ['戛', '然', '而', '止'],
    ['jia', 'ran', 'er', 'zhi'],
  ],
  [
    ['念', '念', '不', '忘'],
    ['nian', 'nian', 'bu', 'wang'],
  ],
  [
    ['偷', '工', '减', '料'],
    ['tou', 'gong', 'jian', 'liao'],
  ],
  [
    ['津', '津', '有', '味'],
    ['jin', 'jin', 'you', 'wei'],
  ],
  [
    ['改', '头', '换', '面'],
    ['gai', 'tou', 'huan', 'mian'],
  ],
  [
    ['据', '为', '己', '有'],
    ['ju', 'wei', 'ji', 'you'],
  ],
  [
    ['大', '同', '小', '异'],
    ['da', 'tong', 'xiao', 'yi'],
  ],
  [
    ['刮', '目', '相', '看'],
    ['gua', 'mu', 'xiang', 'kan'],
  ],
  [
    ['令', '人', '发', '指'],
    ['ling', 'ren', 'fa', 'zhi'],
  ],
  [
    ['目', '瞪', '口', '呆'],
    ['mu', 'deng', 'kou', 'dai'],
  ],
  [
    ['雷', '厉', '风', '行'],
    ['lei', 'li', 'feng', 'xing'],
  ],
  [
    ['风', '雨', '无', '阻'],
    ['feng', 'yu', 'wu', 'zu'],
  ],
  [
    ['江', '郎', '才', '尽'],
    ['jiang', 'lang', 'cai', 'jin'],
  ],
  [
    ['美', '轮', '美', '奂'],
    ['mei', 'lun', 'mei', 'huan'],
  ],
  [
    ['货', '真', '价', '实'],
    ['huo', 'zhen', 'jia', 'shi'],
  ],
  [
    ['三', '令', '五', '申'],
    ['san', 'ling', 'wu', 'shen'],
  ],
  [
    ['感', '慨', '万', '千'],
    ['gan', 'kai', 'wan', 'qian'],
  ],
  [
    ['拾', '金', '不', '昧'],
    ['shi', 'jin', 'bu', 'mei'],
  ],
  [
    ['因', '人', '而', '异'],
    ['yin', 'ren', 'er', 'yi'],
  ],
  [
    ['一', '纸', '空', '文'],
    ['yi', 'zhi', 'kong', 'wen'],
  ],
  [
    ['双', '管', '齐', '下'],
    ['shuang', 'guan', 'qi', 'xia'],
  ],
  [
    ['脱', '口', '而', '出'],
    ['tuo', 'kou', 'er', 'chu'],
  ],
  [
    ['曾', '几', '何', '时'],
    ['ceng', 'ji', 'he', 'shi'],
  ],
  [
    ['逃', '之', '夭', '夭'],
    ['tao', 'zhi', 'yao', 'yao'],
  ],
  [
    ['心', '甘', '情', '愿'],
    ['xin', 'gan', 'qing', 'yuan'],
  ],
  [
    ['一', '朝', '一', '夕'],
    ['yi', 'zhao', 'yi', 'xi'],
  ],
  [
    ['倾', '家', '荡', '产'],
    ['qing', 'jia', 'dang', 'chan'],
  ],
  [
    ['有', '利', '可', '图'],
    ['you', 'li', 'ke', 'tu'],
  ],
  [
    ['万', '众', '一', '心'],
    ['wan', 'zhong', 'yi', 'xin'],
  ],
  [
    ['古', '色', '古', '香'],
    ['gu', 'se', 'gu', 'xiang'],
  ],
  [
    ['刻', '骨', '铭', '心'],
    ['ke', 'gu', 'ming', 'xin'],
  ],
  [
    ['东', '窗', '事', '发'],
    ['dong', 'chuang', 'shi', 'fa'],
  ],
  [
    ['开', '门', '见', '山'],
    ['kai', 'men', 'jian', 'shan'],
  ],
  [
    ['蒸', '蒸', '日', '上'],
    ['zheng', 'zheng', 'ri', 'shang'],
  ],
  [
    ['艰', '苦', '卓', '绝'],
    ['jian', 'ku', 'zhuo', 'jue'],
  ],
  [
    ['承', '上', '启', '下'],
    ['cheng', 'shang', 'qi', 'xia'],
  ],
  [
    ['风', '起', '云', '涌'],
    ['feng', 'qi', 'yun', 'yong'],
  ],
  [
    ['乱', '七', '八', '糟'],
    ['luan', 'qi', 'ba', 'zao'],
  ],
  [
    ['浑', '身', '解', '数'],
    ['hun', 'shen', 'xie', 'shu'],
  ],
  [
    ['一', '意', '孤', '行'],
    ['yi', 'yi', 'gu', 'xing'],
  ],
  [
    ['年', '复', '一', '年'],
    ['nian', 'fu', 'yi', 'nian'],
  ],
  [
    ['水', '土', '不', '服'],
    ['shui', 'tu', 'bu', 'fu'],
  ],
  [
    ['绝', '无', '仅', '有'],
    ['jue', 'wu', 'jin', 'you'],
  ],
  [
    ['奄', '奄', '一', '息'],
    ['yan', 'yan', 'yi', 'xi'],
  ],
  [
    ['生', '生', '不', '息'],
    ['sheng', 'sheng', 'bu', 'xi'],
  ],
  [
    ['迫', '不', '得', '已'],
    ['po', 'bu', 'de', 'yi'],
  ],
  [
    ['独', '善', '其', '身'],
    ['du', 'shan', 'qi', 'shen'],
  ],
  [
    ['恰', '到', '好', '处'],
    ['qia', 'dao', 'hao', 'chu'],
  ],
  [
    ['一', '触', '即', '发'],
    ['yi', 'chu', 'ji', 'fa'],
  ],
  [
    ['说', '三', '道', '四'],
    ['shuo', 'san', 'dao', 'si'],
  ],
  [
    ['不', '胜', '枚', '举'],
    ['bu', 'sheng', 'mei', 'ju'],
  ],
  [
    ['各', '抒', '己', '见'],
    ['ge', 'shu', 'ji', 'jian'],
  ],
  [
    ['意', '味', '深', '长'],
    ['yi', 'wei', 'shen', 'chang'],
  ],
  [
    ['生', '死', '存', '亡'],
    ['sheng', 'si', 'cun', 'wang'],
  ],
  [
    ['蠢', '蠢', '欲', '动'],
    ['chun', 'chun', 'yu', 'dong'],
  ],
  [
    ['摇', '摇', '欲', '坠'],
    ['yao', 'yao', 'yu', 'zhui'],
  ],
  [
    ['世', '外', '桃', '源'],
    ['shi', 'wai', 'tao', 'yuan'],
  ],
  [
    ['滔', '滔', '不', '绝'],
    ['tao', 'tao', 'bu', 'jue'],
  ],
  [
    ['欣', '欣', '向', '荣'],
    ['xin', 'xin', 'xiang', 'rong'],
  ],
  [
    ['添', '砖', '加', '瓦'],
    ['tian', 'zhuan', 'jia', 'wa'],
  ],
  [
    ['来', '势', '汹', '汹'],
    ['lai', 'shi', 'xiong', 'xiong'],
  ],
  [
    ['有', '朝', '一', '日'],
    ['you', 'zhao', 'yi', 'ri'],
  ],
  [
    ['疑', '难', '杂', '症'],
    ['yi', 'nan', 'za', 'zheng'],
  ],
  [
    ['指', '日', '可', '待'],
    ['zhi', 'ri', 'ke', 'dai'],
  ],
  [
    ['每', '况', '愈', '下'],
    ['mei', 'kuang', 'yu', 'xia'],
  ],
  [
    ['精', '打', '细', '算'],
    ['jing', 'da', 'xi', 'suan'],
  ],
  [
    ['真', '知', '灼', '见'],
    ['zhen', 'zhi', 'zhuo', 'jian'],
  ],
  [
    ['遥', '遥', '无', '期'],
    ['yao', 'yao', 'wu', 'qi'],
  ],
  [
    ['代', '代', '相', '传'],
    ['dai', 'dai', 'xiang', 'chuan'],
  ],
  [
    ['勇', '往', '直', '前'],
    ['yong', 'wang', 'zhi', 'qian'],
  ],
  [
    ['好', '景', '不', '长'],
    ['hao', 'jing', 'bu', 'chang'],
  ],
  [
    ['另', '辟', '蹊', '径'],
    ['ling', 'pi', 'xi', 'jing'],
  ],
  [
    ['朝', '气', '蓬', '勃'],
    ['zhao', 'qi', 'peng', 'bo'],
  ],
  [
    ['见', '怪', '不', '怪'],
    ['jian', 'guai', 'bu', 'guai'],
  ],
  [
    ['一', '劳', '永', '逸'],
    ['yi', 'lao', 'yong', 'yi'],
  ],
  [
    ['目', '不', '暇', '接'],
    ['mu', 'bu', 'xia', 'jie'],
  ],
  [
    ['脍', '炙', '人', '口'],
    ['kuai', 'zhi', 'ren', 'kou'],
  ],
  [
    ['无', '所', '事', '事'],
    ['wu', 'suo', 'shi', 'shi'],
  ],
  [
    ['甚', '嚣', '尘', '上'],
    ['shen', 'xiao', 'chen', 'shang'],
  ],
  [
    ['时', '不', '我', '待'],
    ['shi', 'bu', 'wo', 'dai'],
  ],
  [
    ['打', '成', '一', '片'],
    ['da', 'cheng', 'yi', 'pian'],
  ],
  [
    ['一', '成', '不', '变'],
    ['yi', 'cheng', 'bu', 'bian'],
  ],
  [
    ['怀', '恨', '在', '心'],
    ['huai', 'hen', 'zai', 'xin'],
  ],
  [
    ['总', '而', '言', '之'],
    ['zong', 'er', 'yan', 'zhi'],
  ],
  [
    ['艰', '苦', '创', '业'],
    ['jian', 'ku', 'chuang', 'ye'],
  ],
  [
    ['不', '务', '正', '业'],
    ['bu', 'wu', 'zheng', 'ye'],
  ],
  [
    ['身', '无', '分', '文'],
    ['shen', 'wu', 'fen', 'wen'],
  ],
  [
    ['别', '具', '一', '格'],
    ['bie', 'ju', 'yi', 'ge'],
  ],
  [
    ['治', '病', '救', '人'],
    ['zhi', 'bing', 'jiu', 'ren'],
  ],
  [
    ['岌', '岌', '可', '危'],
    ['ji', 'ji', 'ke', 'wei'],
  ],
  [
    ['丰', '功', '伟', '绩'],
    ['feng', 'gong', 'wei', 'ji'],
  ],
  [
    ['他', '山', '之', '石'],
    ['ta', 'shan', 'zhi', 'shi'],
  ],
  [
    ['避', '重', '就', '轻'],
    ['bi', 'zhong', 'jiu', 'qing'],
  ],
  [
    ['按', '部', '就', '班'],
    ['an', 'bu', 'jiu', 'ban'],
  ],
  [
    ['急', '转', '直', '下'],
    ['ji', 'zhuan', 'zhi', 'xia'],
  ],
  [
    ['一', '举', '两', '得'],
    ['yi', 'ju', 'liang', 'de'],
  ],
  [
    ['兴', '高', '采', '烈'],
    ['xing', 'gao', 'cai', 'lie'],
  ],
  [
    ['同', '心', '协', '力'],
    ['tong', 'xin', 'xie', 'li'],
  ],
  [
    ['侃', '侃', '而', '谈'],
    ['kan', 'kan', 'er', 'tan'],
  ],
  [
    ['恼', '羞', '成', '怒'],
    ['nao', 'xiu', 'cheng', 'nu'],
  ],
  [
    ['天', '壤', '之', '别'],
    ['tian', 'rang', 'zhi', 'bie'],
  ],
  [
    ['咄', '咄', '逼', '人'],
    ['duo', 'duo', 'bi', 'ren'],
  ],
  [
    ['千', '篇', '一', '律'],
    ['qian', 'pian', 'yi', 'lv'],
  ],
  [
    ['寸', '步', '难', '行'],
    ['cun', 'bu', 'nan', 'xing'],
  ],
  [
    ['嘘', '寒', '问', '暖'],
    ['xu', 'han', 'wen', 'nuan'],
  ],
  [
    ['不', '失', '时', '机'],
    ['bu', 'shi', 'shi', 'ji'],
  ],
  [
    ['直', '截', '了', '当'],
    ['zhi', 'jie', 'liao', 'dang'],
  ],
  [
    ['白', '手', '起', '家'],
    ['bai', 'shou', 'qi', 'jia'],
  ],
  [
    ['人', '去', '楼', '空'],
    ['ren', 'qu', 'lou', 'kong'],
  ],
  [
    ['置', '若', '罔', '闻'],
    ['zhi', 'ruo', 'wang', 'wen'],
  ],
  [
    ['瞠', '目', '结', '舌'],
    ['cheng', 'mu', 'jie', 'she'],
  ],
  [
    ['长', '途', '跋', '涉'],
    ['chang', 'tu', 'ba', 'she'],
  ],
  [
    ['群', '策', '群', '力'],
    ['qun', 'ce', 'qun', 'li'],
  ],
  [
    ['前', '车', '之', '鉴'],
    ['qian', 'che', 'zhi', 'jian'],
  ],
  [
    ['一', '拥', '而', '上'],
    ['yi', 'yong', 'er', 'shang'],
  ],
  [
    ['毋', '庸', '讳', '言'],
    ['wu', 'yong', 'hui', 'yan'],
  ],
  [
    ['违', '法', '乱', '纪'],
    ['wei', 'fa', 'luan', 'ji'],
  ],
  [
    ['痛', '定', '思', '痛'],
    ['tong', 'ding', 'si', 'tong'],
  ],
  [
    ['难', '上', '加', '难'],
    ['nan', 'shang', 'jia', 'nan'],
  ],
  [
    ['并', '肩', '作', '战'],
    ['bing', 'jian', 'zuo', 'zhan'],
  ],
  [
    ['始', '终', '如', '一'],
    ['shi', 'zhong', 'ru', 'yi'],
  ],
  [
    ['数', '不', '胜', '数'],
    ['shu', 'bu', 'sheng', 'shu'],
  ],
  [
    ['啼', '笑', '皆', '非'],
    ['ti', 'xiao', 'jie', 'fei'],
  ],
  [
    ['不', '闻', '不', '问'],
    ['bu', 'wen', 'bu', 'wen'],
  ],
  [
    ['不', '相', '上', '下'],
    ['bu', 'xiang', 'shang', 'xia'],
  ],
  [
    ['自', '给', '自', '足'],
    ['zi', 'ji', 'zi', 'zu'],
  ],
  [
    ['有', '生', '之', '年'],
    ['you', 'sheng', 'zhi', 'nian'],
  ],
  [
    ['打', '草', '惊', '蛇'],
    ['da', 'cao', 'jing', 'she'],
  ],
  [
    ['鼓', '舞', '人', '心'],
    ['gu', 'wu', 'ren', 'xin'],
  ],
  [
    ['三', '五', '成', '群'],
    ['san', 'wu', 'cheng', 'qun'],
  ],
  [
    ['铿', '锵', '有', '力'],
    ['keng', 'qiang', 'you', 'li'],
  ],
  [
    ['赏', '心', '悦', '目'],
    ['shang', 'xin', 'yue', 'mu'],
  ],
  [
    ['夜', '以', '继', '日'],
    ['ye', 'yi', 'ji', 'ri'],
  ],
  [
    ['起', '早', '贪', '黑'],
    ['qi', 'zao', 'tan', 'hei'],
  ],
  [
    ['爱', '不', '释', '手'],
    ['ai', 'bu', 'shi', 'shou'],
  ],
  [
    ['手', '足', '无', '措'],
    ['shou', 'zu', 'wu', 'cuo'],
  ],
  [
    ['一', '分', '为', '二'],
    ['yi', 'fen', 'wei', 'er'],
  ],
  [
    ['不', '可', '多', '得'],
    ['bu', 'ke', 'duo', 'de'],
  ],
  [
    ['喜', '出', '望', '外'],
    ['xi', 'chu', 'wang', 'wai'],
  ],
  [
    ['口', '口', '相', '传'],
    ['kou', 'kou', 'xiang', 'chuan'],
  ],
  [
    ['只', '争', '朝', '夕'],
    ['zhi', 'zheng', 'zhao', 'xi'],
  ],
  [
    ['气', '喘', '吁', '吁'],
    ['qi', 'chuan', 'xu', 'xu'],
  ],
  [
    ['猝', '不', '及', '防'],
    ['cu', 'bu', 'ji', 'fang'],
  ],
  [
    ['不', '甘', '示', '弱'],
    ['bu', 'gan', 'shi', 'ruo'],
  ],
  [
    ['亡', '羊', '补', '牢'],
    ['wang', 'yang', 'bu', 'lao'],
  ],
  [
    ['意', '气', '风', '发'],
    ['yi', 'qi', 'feng', 'fa'],
  ],
  [
    ['摩', '拳', '擦', '掌'],
    ['mo', 'quan', 'ca', 'zhang'],
  ],
  [
    ['喜', '怒', '哀', '乐'],
    ['xi', 'nu', 'ai', 'le'],
  ],
  [
    ['惟', '妙', '惟', '肖'],
    ['wei', 'miao', 'wei', 'xiao'],
  ],
  [
    ['自', '相', '矛', '盾'],
    ['zi', 'xiang', 'mao', 'dun'],
  ],
  [
    ['中', '流', '砥', '柱'],
    ['zhong', 'liu', 'di', 'zhu'],
  ],
  [
    ['真', '相', '大', '白'],
    ['zhen', 'xiang', 'da', 'bai'],
  ],
  [
    ['早', '出', '晚', '归'],
    ['zao', 'chu', 'wan', 'gui'],
  ],
  [
    ['繁', '荣', '昌', '盛'],
    ['fan', 'rong', 'chang', 'sheng'],
  ],
  [
    ['异', '口', '同', '声'],
    ['yi', 'kou', 'tong', 'sheng'],
  ],
  [
    ['喜', '气', '洋', '洋'],
    ['xi', 'qi', 'yang', 'yang'],
  ],
  [
    ['大', '是', '大', '非'],
    ['da', 'shi', 'da', 'fei'],
  ],
  [
    ['自', '食', '其', '力'],
    ['zi', 'shi', 'qi', 'li'],
  ],
  [
    ['言', '传', '身', '教'],
    ['yan', 'chuan', 'shen', 'jiao'],
  ],
  [
    ['浴', '血', '奋', '战'],
    ['yu', 'xue', 'fen', 'zhan'],
  ],
  [
    ['大', '惊', '小', '怪'],
    ['da', 'jing', 'xiao', 'guai'],
  ],
  [
    ['转', '危', '为', '安'],
    ['zhuan', 'wei', 'wei', 'an'],
  ],
  [
    ['见', '缝', '插', '针'],
    ['jian', 'feng', 'cha', 'zhen'],
  ],
  [
    ['平', '易', '近', '人'],
    ['ping', 'yi', 'jin', 'ren'],
  ],
  [
    ['古', '今', '中', '外'],
    ['gu', 'jin', 'zhong', 'wai'],
  ],
  [
    ['怨', '声', '载', '道'],
    ['yuan', 'sheng', 'zai', 'dao'],
  ],
  [
    ['人', '声', '鼎', '沸'],
    ['ren', 'sheng', 'ding', 'fei'],
  ],
  [
    ['千', '里', '迢', '迢'],
    ['qian', 'li', 'tiao', 'tiao'],
  ],
  [
    ['融', '会', '贯', '通'],
    ['rong', 'hui', 'guan', 'tong'],
  ],
  [
    ['整', '装', '待', '发'],
    ['zheng', 'zhuang', 'dai', 'fa'],
  ],
  [
    ['得', '心', '应', '手'],
    ['de', 'xin', 'ying', 'shou'],
  ],
  [
    ['永', '无', '止', '境'],
    ['yong', 'wu', 'zhi', 'jing'],
  ],
  [
    ['犹', '豫', '不', '决'],
    ['you', 'yu', 'bu', 'jue'],
  ],
  [
    ['火', '眼', '金', '睛'],
    ['huo', 'yan', 'jin', 'jing'],
  ],
  [
    ['袖', '手', '旁', '观'],
    ['xiu', 'shou', 'pang', 'guan'],
  ],
  [
    ['苦', '口', '婆', '心'],
    ['ku', 'kou', 'po', 'xin'],
  ],
  [
    ['游', '刃', '有', '余'],
    ['you', 'ren', 'you', 'yu'],
  ],
  [
    ['始', '终', '不', '渝'],
    ['shi', 'zhong', 'bu', 'yu'],
  ],
  [
    ['耿', '耿', '于', '怀'],
    ['geng', 'geng', 'yu', 'huai'],
  ],
  [
    ['油', '然', '而', '生'],
    ['you', 'ran', 'er', 'sheng'],
  ],
  [
    ['害', '群', '之', '马'],
    ['hai', 'qun', 'zhi', 'ma'],
  ],
  [
    ['权', '宜', '之', '计'],
    ['quan', 'yi', 'zhi', 'ji'],
  ],
  [
    ['背', '井', '离', '乡'],
    ['bei', 'jing', 'li', 'xiang'],
  ],
  [
    ['支', '离', '破', '碎'],
    ['zhi', 'li', 'po', 'sui'],
  ],
  [
    ['皆', '大', '欢', '喜'],
    ['jie', 'da', 'huan', 'xi'],
  ],
  [
    ['大', '名', '鼎', '鼎'],
    ['da', 'ming', 'ding', 'ding'],
  ],
  [
    ['合', '二', '为', '一'],
    ['he', 'er', 'wei', 'yi'],
  ],
  [
    ['风', '吹', '草', '动'],
    ['feng', 'chui', 'cao', 'dong'],
  ],
  [
    ['依', '依', '不', '舍'],
    ['yi', 'yi', 'bu', 'she'],
  ],
  [
    ['秋', '高', '气', '爽'],
    ['qiu', 'gao', 'qi', 'shuang'],
  ],
  [
    ['挺', '身', '而', '出'],
    ['ting', 'shen', 'er', 'chu'],
  ],
  [
    ['掩', '人', '耳', '目'],
    ['yan', 'ren', 'er', 'mu'],
  ],
  [
    ['姗', '姗', '来', '迟'],
    ['shan', 'shan', 'lai', 'chi'],
  ],
  [
    ['实', '至', '名', '归'],
    ['shi', 'zhi', 'ming', 'gui'],
  ],
  [
    ['事', '与', '愿', '违'],
    ['shi', 'yu', 'yuan', 'wei'],
  ],
  [
    ['翩', '翩', '起', '舞'],
    ['pian', 'pian', 'qi', 'wu'],
  ],
  [
    ['凤', '毛', '麟', '角'],
    ['feng', 'mao', 'lin', 'jiao'],
  ],
  [
    ['忍', '气', '吞', '声'],
    ['ren', 'qi', 'tun', 'sheng'],
  ],
  [
    ['耳', '濡', '目', '染'],
    ['er', 'ru', 'mu', 'ran'],
  ],
  [
    ['天', '伦', '之', '乐'],
    ['tian', 'lun', 'zhi', 'le'],
  ],
  [
    ['一', '气', '呵', '成'],
    ['yi', 'qi', 'he', 'cheng'],
  ],
  [
    ['千', '载', '难', '逢'],
    ['qian', 'zai', 'nan', 'feng'],
  ],
  [
    ['满', '目', '疮', '痍'],
    ['man', 'mu', 'chuang', 'yi'],
  ],
  [
    ['一', '无', '所', '有'],
    ['yi', 'wu', 'suo', 'you'],
  ],
  [
    ['追', '根', '溯', '源'],
    ['zhui', 'gen', 'su', 'yuan'],
  ],
  [
    ['精', '神', '抖', '擞'],
    ['jing', 'shen', 'dou', 'sou'],
  ],
  [
    ['人', '心', '惶', '惶'],
    ['ren', 'xin', 'huang', 'huang'],
  ],
  [
    ['朝', '夕', '相', '处'],
    ['zhao', 'xi', 'xiang', 'chu'],
  ],
  [
    ['当', '仁', '不', '让'],
    ['dang', 'ren', 'bu', 'rang'],
  ],
  [
    ['不', '依', '不', '饶'],
    ['bu', 'yi', 'bu', 'rao'],
  ],
  [
    ['设', '身', '处', '地'],
    ['she', 'shen', 'chu', 'di'],
  ],
  [
    ['焦', '头', '烂', '额'],
    ['jiao', 'tou', 'lan', 'e'],
  ],
  [
    ['无', '缘', '无', '故'],
    ['wu', 'yuan', 'wu', 'gu'],
  ],
  [
    ['日', '积', '月', '累'],
    ['ri', 'ji', 'yue', 'lei'],
  ],
  [
    ['旷', '日', '持', '久'],
    ['kuang', 'ri', 'chi', 'jiu'],
  ],
  [
    ['不', '胫', '而', '走'],
    ['bu', 'jing', 'er', 'zou'],
  ],
  [
    ['忍', '俊', '不', '禁'],
    ['ren', 'jun', 'bu', 'jin'],
  ],
  [
    ['成', '群', '结', '队'],
    ['cheng', 'qun', 'jie', 'dui'],
  ],
  [
    ['无', '稽', '之', '谈'],
    ['wu', 'ji', 'zhi', 'tan'],
  ],
  [
    ['债', '台', '高', '筑'],
    ['zhai', 'tai', 'gao', 'zhu'],
  ],
  [
    ['因', '材', '施', '教'],
    ['yin', 'cai', 'shi', 'jiao'],
  ],
  [
    ['居', '安', '思', '危'],
    ['ju', 'an', 'si', 'wei'],
  ],
  [
    ['手', '忙', '脚', '乱'],
    ['shou', 'mang', 'jiao', 'luan'],
  ],
  [
    ['轻', '重', '缓', '急'],
    ['qing', 'zhong', 'huan', 'ji'],
  ],
  [
    ['应', '接', '不', '暇'],
    ['ying', 'jie', 'bu', 'xia'],
  ],
  [
    ['矢', '志', '不', '渝'],
    ['shi', 'zhi', 'bu', 'yu'],
  ],
  [
    ['触', '手', '可', '及'],
    ['chu', 'shou', 'ke', 'ji'],
  ],
  [
    ['发', '人', '深', '省'],
    ['fa', 'ren', 'shen', 'xing'],
  ],
  [
    ['破', '门', '而', '入'],
    ['po', 'men', 'er', 'ru'],
  ],
  [
    ['异', '曲', '同', '工'],
    ['yi', 'qu', 'tong', 'gong'],
  ],
  [
    ['左', '邻', '右', '舍'],
    ['zuo', 'lin', 'you', 'she'],
  ],
  [
    ['乐', '在', '其', '中'],
    ['le', 'zai', 'qi', 'zhong'],
  ],
  [
    ['以', '身', '试', '法'],
    ['yi', 'shen', 'shi', 'fa'],
  ],
  [
    ['养', '家', '糊', '口'],
    ['yang', 'jia', 'hu', 'kou'],
  ],
  [
    ['众', '矢', '之', '的'],
    ['zhong', 'shi', 'zhi', 'di'],
  ],
  [
    ['心', '平', '气', '和'],
    ['xin', 'ping', 'qi', 'he'],
  ],
  [
    ['若', '隐', '若', '现'],
    ['ruo', 'yin', 'ruo', 'xian'],
  ],
  [
    ['哗', '众', '取', '宠'],
    ['hua', 'zhong', 'qu', 'chong'],
  ],
  [
    ['空', '穴', '来', '风'],
    ['kong', 'xue', 'lai', 'feng'],
  ],
  [
    ['因', '势', '利', '导'],
    ['yin', 'shi', 'li', 'dao'],
  ],
  [
    ['德', '高', '望', '重'],
    ['de', 'gao', 'wang', 'zhong'],
  ],
  [
    ['有', '恃', '无', '恐'],
    ['you', 'shi', 'wu', 'kong'],
  ],
  [
    ['人', '命', '关', '天'],
    ['ren', 'ming', 'guan', 'tian'],
  ],
  [
    ['气', '势', '磅', '礴'],
    ['qi', 'shi', 'bang', 'bo'],
  ],
  [
    ['昙', '花', '一', '现'],
    ['tan', 'hua', 'yi', 'xian'],
  ],
  [
    ['息', '事', '宁', '人'],
    ['xi', 'shi', 'ning', 'ren'],
  ],
  [
    ['荡', '然', '无', '存'],
    ['dang', 'ran', 'wu', 'cun'],
  ],
  [
    ['欢', '欣', '鼓', '舞'],
    ['huan', 'xin', 'gu', 'wu'],
  ],
  [
    ['惊', '天', '动', '地'],
    ['jing', 'tian', 'dong', 'di'],
  ],
  [
    ['艰', '难', '险', '阻'],
    ['jian', 'nan', 'xian', 'zu'],
  ],
  [
    ['险', '象', '环', '生'],
    ['xian', 'xiang', 'huan', 'sheng'],
  ],
  [
    ['切', '身', '体', '会'],
    ['qie', 'shen', 'ti', 'hui'],
  ],
  [
    ['以', '假', '乱', '真'],
    ['yi', 'jia', 'luan', 'zhen'],
  ],
  [
    ['天', '寒', '地', '冻'],
    ['tian', 'han', 'di', 'dong'],
  ],
  [
    ['辞', '旧', '迎', '新'],
    ['ci', 'jiu', 'ying', 'xin'],
  ],
  [
    ['负', '债', '累', '累'],
    ['fu', 'zhai', 'lei', 'lei'],
  ],
  [
    ['任', '劳', '任', '怨'],
    ['ren', 'lao', 'ren', 'yuan'],
  ],
  [
    ['走', '投', '无', '路'],
    ['zou', 'tou', 'wu', 'lu'],
  ],
  [
    ['重', '蹈', '覆', '辙'],
    ['chong', 'dao', 'fu', 'zhe'],
  ],
  [
    ['无', '时', '无', '刻'],
    ['wu', 'shi', 'wu', 'ke'],
  ],
  [
    ['成', '家', '立', '业'],
    ['cheng', 'jia', 'li', 'ye'],
  ],
  [
    ['炎', '黄', '子', '孙'],
    ['yan', 'huang', 'zi', 'sun'],
  ],
  [
    ['剑', '拔', '弩', '张'],
    ['jian', 'ba', 'nu', 'zhang'],
  ],
  [
    ['将', '心', '比', '心'],
    ['jiang', 'xin', 'bi', 'xin'],
  ],
  [
    ['一', '览', '无', '余'],
    ['yi', 'lan', 'wu', 'yu'],
  ],
  [
    ['为', '所', '欲', '为'],
    ['wei', 'suo', 'yu', 'wei'],
  ],
  [
    ['名', '正', '言', '顺'],
    ['ming', 'zheng', 'yan', 'shun'],
  ],
  [
    ['纸', '上', '谈', '兵'],
    ['zhi', 'shang', 'tan', 'bing'],
  ],
  [
    ['川', '流', '不', '息'],
    ['chuan', 'liu', 'bu', 'xi'],
  ],
  [
    ['夜', '深', '人', '静'],
    ['ye', 'shen', 'ren', 'jing'],
  ],
  [
    ['美', '不', '胜', '收'],
    ['mei', 'bu', 'sheng', 'shou'],
  ],
  [
    ['善', '始', '善', '终'],
    ['shan', 'shi', 'shan', 'zhong'],
  ],
  [
    ['枝', '繁', '叶', '茂'],
    ['zhi', 'fan', 'ye', 'mao'],
  ],
  [
    ['斩', '钉', '截', '铁'],
    ['zhan', 'ding', 'jie', 'tie'],
  ],
  [
    ['大', '有', '裨', '益'],
    ['da', 'you', 'bi', 'yi'],
  ],
  [
    ['防', '微', '杜', '渐'],
    ['fang', 'wei', 'du', 'jian'],
  ],
  [
    ['无', '影', '无', '踪'],
    ['wu', 'ying', 'wu', 'zong'],
  ],
  [
    ['举', '手', '之', '劳'],
    ['ju', 'shou', 'zhi', 'lao'],
  ],
  [
    ['走', '马', '上', '任'],
    ['zou', 'ma', 'shang', 'ren'],
  ],
  [
    ['拍', '手', '称', '快'],
    ['pai', 'shou', 'cheng', 'kuai'],
  ],
  [
    ['海', '纳', '百', '川'],
    ['hai', 'na', 'bai', 'chuan'],
  ],
  [
    ['来', '历', '不', '明'],
    ['lai', 'li', 'bu', 'ming'],
  ],
  [
    ['汗', '流', '浃', '背'],
    ['han', 'liu', 'jia', 'bei'],
  ],
  [
    ['七', '嘴', '八', '舌'],
    ['qi', 'zui', 'ba', 'she'],
  ],
  [
    ['本', '末', '倒', '置'],
    ['ben', 'mo', 'dao', 'zhi'],
  ],
  [
    ['混', '淆', '视', '听'],
    ['hun', 'xiao', 'shi', 'ting'],
  ],
  [
    ['热', '血', '沸', '腾'],
    ['re', 'xue', 'fei', 'teng'],
  ],
  [
    ['左', '右', '为', '难'],
    ['zuo', 'you', 'wei', 'nan'],
  ],
  [
    ['风', '平', '浪', '静'],
    ['feng', 'ping', 'lang', 'jing'],
  ],
  [
    ['如', '履', '薄', '冰'],
    ['ru', 'lv', 'bo', 'bing'],
  ],
  [
    ['先', '天', '不', '足'],
    ['xian', 'tian', 'bu', 'zu'],
  ],
  [
    ['招', '摇', '撞', '骗'],
    ['zhao', 'yao', 'zhuang', 'pian'],
  ],
  [
    ['解', '疑', '释', '惑'],
    ['jie', 'yi', 'shi', 'huo'],
  ],
  [
    ['不', '速', '之', '客'],
    ['bu', 'su', 'zhi', 'ke'],
  ],
  [
    ['心', '服', '口', '服'],
    ['xin', 'fu', 'kou', 'fu'],
  ],
  [
    ['东', '拼', '西', '凑'],
    ['dong', 'pin', 'xi', 'cou'],
  ],
  [
    ['一', '落', '千', '丈'],
    ['yi', 'luo', 'qian', 'zhang'],
  ],
  [
    ['火', '上', '浇', '油'],
    ['huo', 'shang', 'jiao', 'you'],
  ],
  [
    ['就', '事', '论', '事'],
    ['jiu', 'shi', 'lun', 'shi'],
  ],
  [
    ['没', '完', '没', '了'],
    ['mei', 'wan', 'mei', 'liao'],
  ],
  [
    ['危', '言', '耸', '听'],
    ['wei', 'yan', 'song', 'ting'],
  ],
  [
    ['天', '马', '行', '空'],
    ['tian', 'ma', 'xing', 'kong'],
  ],
  [
    ['煞', '费', '苦', '心'],
    ['sha', 'fei', 'ku', 'xin'],
  ],
  [
    ['自', '欺', '欺', '人'],
    ['zi', 'qi', 'qi', 'ren'],
  ],
  [
    ['讳', '莫', '如', '深'],
    ['hui', 'mo', 'ru', 'shen'],
  ],
  [
    ['断', '章', '取', '义'],
    ['duan', 'zhang', 'qu', 'yi'],
  ],
  [
    ['五', '彩', '缤', '纷'],
    ['wu', 'cai', 'bin', 'fen'],
  ],
  [
    ['进', '退', '两', '难'],
    ['jin', 'tui', 'liang', 'nan'],
  ],
  [
    ['改', '过', '自', '新'],
    ['gai', 'guo', 'zi', 'xin'],
  ],
  [
    ['急', '于', '求', '成'],
    ['ji', 'yu', 'qiu', 'cheng'],
  ],
  [
    ['严', '惩', '不', '贷'],
    ['yan', 'cheng', 'bu', 'dai'],
  ],
  [
    ['疲', '惫', '不', '堪'],
    ['pi', 'bei', 'bu', 'kan'],
  ],
  [
    ['百', '折', '不', '挠'],
    ['bai', 'zhe', 'bu', 'nao'],
  ],
  [
    ['大', '显', '身', '手'],
    ['da', 'xian', 'shen', 'shou'],
  ],
  [
    ['头', '破', '血', '流'],
    ['tou', 'po', 'xue', 'liu'],
  ],
  [
    ['浑', '水', '摸', '鱼'],
    ['hun', 'shui', 'mo', 'yu'],
  ],
  [
    ['不', '容', '置', '疑'],
    ['bu', 'rong', 'zhi', 'yi'],
  ],
  [
    ['孜', '孜', '不', '倦'],
    ['zi', 'zi', 'bu', 'juan'],
  ],
  [
    ['长', '久', '之', '计'],
    ['chang', 'jiu', 'zhi', 'ji'],
  ],
  [
    ['闻', '名', '遐', '迩'],
    ['wen', 'ming', 'xia', 'er'],
  ],
  [
    ['指', '手', '画', '脚'],
    ['zhi', 'shou', 'hua', 'jiao'],
  ],
  [
    ['赫', '赫', '有', '名'],
    ['he', 'he', 'you', 'ming'],
  ],
  [
    ['灭', '顶', '之', '灾'],
    ['mie', 'ding', 'zhi', 'zai'],
  ],
  [
    ['如', '影', '随', '形'],
    ['ru', 'ying', 'sui', 'xing'],
  ],
  [
    ['风', '调', '雨', '顺'],
    ['feng', 'tiao', 'yu', 'shun'],
  ],
  [
    ['茶', '余', '饭', '后'],
    ['cha', 'yu', 'fan', 'hou'],
  ],
  [
    ['痛', '哭', '流', '涕'],
    ['tong', 'ku', 'liu', 'ti'],
  ],
  [
    ['高', '屋', '建', '瓴'],
    ['gao', 'wu', 'jian', 'ling'],
  ],
  [
    ['走', '马', '观', '花'],
    ['zou', 'ma', 'guan', 'hua'],
  ],
  [
    ['憨', '态', '可', '掬'],
    ['han', 'tai', 'ke', 'ju'],
  ],
  [
    ['屡', '教', '不', '改'],
    ['lv', 'jiao', 'bu', 'gai'],
  ],
  [
    ['歪', '风', '邪', '气'],
    ['wai', 'feng', 'xie', 'qi'],
  ],
  [
    ['失', '之', '交', '臂'],
    ['shi', 'zhi', 'jiao', 'bi'],
  ],
  [
    ['平', '心', '而', '论'],
    ['ping', 'xin', 'er', 'lun'],
  ],
  [
    ['不', '在', '话', '下'],
    ['bu', 'zai', 'hua', 'xia'],
  ],
  [
    ['担', '惊', '受', '怕'],
    ['dan', 'jing', 'shou', 'pa'],
  ],
  [
    ['约', '定', '俗', '成'],
    ['yue', 'ding', 'su', 'cheng'],
  ],
  [
    ['廉', '洁', '奉', '公'],
    ['lian', 'jie', 'feng', 'gong'],
  ],
  [
    ['果', '不', '其', '然'],
    ['guo', 'bu', 'qi', 'ran'],
  ],
  [
    ['晴', '天', '霹', '雳'],
    ['qing', 'tian', 'pi', 'li'],
  ],
  [
    ['正', '本', '清', '源'],
    ['zheng', 'ben', 'qing', 'yuan'],
  ],
  [
    ['不', '负', '众', '望'],
    ['bu', 'fu', 'zhong', 'wang'],
  ],
  [
    ['瞬', '息', '万', '变'],
    ['shun', 'xi', 'wan', 'bian'],
  ],
  [
    ['不', '可', '逾', '越'],
    ['bu', 'ke', 'yu', 'yue'],
  ],
  [
    ['语', '焉', '不', '详'],
    ['yu', 'yan', 'bu', 'xiang'],
  ],
  [
    ['悲', '痛', '欲', '绝'],
    ['bei', 'tong', 'yu', 'jue'],
  ],
  [
    ['各', '显', '神', '通'],
    ['ge', 'xian', 'shen', 'tong'],
  ],
  [
    ['前', '赴', '后', '继'],
    ['qian', 'fu', 'hou', 'ji'],
  ],
  [
    ['翻', '山', '越', '岭'],
    ['fan', 'shan', 'yue', 'ling'],
  ],
  [
    ['临', '危', '受', '命'],
    ['lin', 'wei', 'shou', 'ming'],
  ],
  [
    ['忐', '忑', '不', '安'],
    ['tan', 'te', 'bu', 'an'],
  ],
  [
    ['不', '拘', '一', '格'],
    ['bu', 'ju', 'yi', 'ge'],
  ],
  [
    ['有', '机', '可', '乘'],
    ['you', 'ji', 'ke', 'cheng'],
  ],
  [
    ['漫', '山', '遍', '野'],
    ['man', 'shan', 'bian', 'ye'],
  ],
  [
    ['赞', '叹', '不', '已'],
    ['zan', 'tan', 'bu', 'yi'],
  ],
  [
    ['而', '立', '之', '年'],
    ['er', 'li', 'zhi', 'nian'],
  ],
  [
    ['不', '假', '思', '索'],
    ['bu', 'jia', 'si', 'suo'],
  ],
  [
    ['不', '屈', '不', '挠'],
    ['bu', 'qu', 'bu', 'nao'],
  ],
  [
    ['潸', '然', '泪', '下'],
    ['shan', 'ran', 'lei', 'xia'],
  ],
  [
    ['礼', '尚', '往', '来'],
    ['li', 'shang', 'wang', 'lai'],
  ],
  [
    ['灵', '机', '一', '动'],
    ['ling', 'ji', 'yi', 'dong'],
  ],
  [
    ['引', '人', '入', '胜'],
    ['yin', 'ren', 'ru', 'sheng'],
  ],
  [
    ['若', '无', '其', '事'],
    ['ruo', 'wu', 'qi', 'shi'],
  ],
  [
    ['熟', '视', '无', '睹'],
    ['shu', 'shi', 'wu', 'du'],
  ],
  [
    ['骇', '人', '听', '闻'],
    ['hai', 'ren', 'ting', 'wen'],
  ],
  [
    ['趋', '利', '避', '害'],
    ['qu', 'li', 'bi', 'hai'],
  ],
  [
    ['精', '力', '充', '沛'],
    ['jing', 'li', 'chong', 'pei'],
  ],
  [
    ['冠', '冕', '堂', '皇'],
    ['guan', 'mian', 'tang', 'huang'],
  ],
  [
    ['分', '道', '扬', '镳'],
    ['fen', 'dao', 'yang', 'biao'],
  ],
  [
    ['荷', '枪', '实', '弹'],
    ['he', 'qiang', 'shi', 'dan'],
  ],
  [
    ['老', '生', '常', '谈'],
    ['lao', 'sheng', 'chang', 'tan'],
  ],
  [
    ['彻', '头', '彻', '尾'],
    ['che', 'tou', 'che', 'wei'],
  ],
  [
    ['安', '身', '立', '命'],
    ['an', 'shen', 'li', 'ming'],
  ],
  [
    ['风', '雨', '同', '舟'],
    ['feng', 'yu', 'tong', 'zhou'],
  ],
  [
    ['游', '手', '好', '闲'],
    ['you', 'shou', 'hao', 'xian'],
  ],
  [
    ['心', '灰', '意', '冷'],
    ['xin', 'hui', 'yi', 'leng'],
  ],
  [
    ['网', '开', '一', '面'],
    ['wang', 'kai', 'yi', 'mian'],
  ],
  [
    ['精', '兵', '强', '将'],
    ['jing', 'bing', 'qiang', 'jiang'],
  ],
  [
    ['电', '闪', '雷', '鸣'],
    ['dian', 'shan', 'lei', 'ming'],
  ],
  [
    ['星', '罗', '棋', '布'],
    ['xing', 'luo', 'qi', 'bu'],
  ],
  [
    ['三', '缄', '其', '口'],
    ['san', 'jian', 'qi', 'kou'],
  ],
  [
    ['众', '目', '睽', '睽'],
    ['zhong', 'mu', 'kui', 'kui'],
  ],
  [
    ['混', '为', '一', '谈'],
    ['hun', 'wei', 'yi', 'tan'],
  ],
  [
    ['不', '欢', '而', '散'],
    ['bu', 'huan', 'er', 'san'],
  ],
  [
    ['井', '井', '有', '条'],
    ['jing', 'jing', 'you', 'tiao'],
  ],
  [
    ['鳞', '次', '栉', '比'],
    ['lin', 'ci', 'zhi', 'bi'],
  ],
  [
    ['自', '以', '为', '是'],
    ['zi', 'yi', 'wei', 'shi'],
  ],
  [
    ['不', '动', '声', '色'],
    ['bu', 'dong', 'sheng', 'se'],
  ],
  [
    ['稳', '扎', '稳', '打'],
    ['wen', 'zha', 'wen', 'da'],
  ],
  [
    ['似', '曾', '相', '识'],
    ['si', 'ceng', 'xiang', 'shi'],
  ],
  [
    ['空', '空', '如', '也'],
    ['kong', 'kong', 'ru', 'ye'],
  ],
  [
    ['危', '在', '旦', '夕'],
    ['wei', 'zai', 'dan', 'xi'],
  ],
  [
    ['开', '诚', '布', '公'],
    ['kai', 'cheng', 'bu', 'gong'],
  ],
  [
    ['可', '歌', '可', '泣'],
    ['ke', 'ge', 'ke', 'qi'],
  ],
  [
    ['口', '诛', '笔', '伐'],
    ['kou', 'zhu', 'bi', 'fa'],
  ],
  [
    ['釜', '底', '抽', '薪'],
    ['fu', 'di', 'chou', 'xin'],
  ],
  [
    ['举', '世', '闻', '名'],
    ['ju', 'shi', 'wen', 'ming'],
  ],
  [
    ['一', '门', '心', '思'],
    ['yi', 'men', 'xin', 'si'],
  ],
  [
    ['不', '一', '而', '足'],
    ['bu', 'yi', 'er', 'zu'],
  ],
  [
    ['德', '艺', '双', '馨'],
    ['de', 'yi', 'shuang', 'xin'],
  ],
  [
    ['胆', '战', '心', '惊'],
    ['dan', 'zhan', 'xin', 'jing'],
  ],
  [
    ['坚', '韧', '不', '拔'],
    ['jian', 'ren', 'bu', 'ba'],
  ],
  [
    ['起', '死', '回', '生'],
    ['qi', 'si', 'hui', 'sheng'],
  ],
  [
    ['全', '神', '贯', '注'],
    ['quan', 'shen', 'guan', 'zhu'],
  ],
  [
    ['死', '里', '逃', '生'],
    ['si', 'li', 'tao', 'sheng'],
  ],
  [
    ['一', '马', '当', '先'],
    ['yi', 'ma', 'dang', 'xian'],
  ],
  [
    ['厚', '积', '薄', '发'],
    ['hou', 'ji', 'bao', 'fa'],
  ],
  [
    ['无', '理', '取', '闹'],
    ['wu', 'li', 'qu', 'nao'],
  ],
  [
    ['当', '机', '立', '断'],
    ['dang', 'ji', 'li', 'duan'],
  ],
  [
    ['名', '存', '实', '亡'],
    ['ming', 'cun', 'shi', 'wang'],
  ],
  [
    ['如', '释', '重', '负'],
    ['ru', 'shi', 'zhong', 'fu'],
  ],
  [
    ['雷', '打', '不', '动'],
    ['lei', 'da', 'bu', 'dong'],
  ],
  [
    ['一', '望', '无', '际'],
    ['yi', 'wang', 'wu', 'ji'],
  ],
  [
    ['与', '世', '隔', '绝'],
    ['yu', 'shi', 'ge', 'jue'],
  ],
  [
    ['门', '可', '罗', '雀'],
    ['men', 'ke', 'luo', 'que'],
  ],
  [
    ['大', '摇', '大', '摆'],
    ['da', 'yao', 'da', 'bai'],
  ],
  [
    ['将', '信', '将', '疑'],
    ['jiang', 'xin', 'jiang', 'yi'],
  ],
  [
    ['饶', '有', '兴', '趣'],
    ['rao', 'you', 'xing', 'qu'],
  ],
  [
    ['心', '旷', '神', '怡'],
    ['xin', 'kuang', 'shen', 'yi'],
  ],
  [
    ['心', '照', '不', '宣'],
    ['xin', 'zhao', 'bu', 'xuan'],
  ],
  [
    ['半', '途', '而', '废'],
    ['ban', 'tu', 'er', 'fei'],
  ],
  [
    ['无', '计', '可', '施'],
    ['wu', 'ji', 'ke', 'shi'],
  ],
  [
    ['一', '塌', '糊', '涂'],
    ['yi', 'ta', 'hu', 'tu'],
  ],
  [
    ['后', '来', '居', '上'],
    ['hou', 'lai', 'ju', 'shang'],
  ],
  [
    ['并', '驾', '齐', '驱'],
    ['bing', 'jia', 'qi', 'qu'],
  ],
  [
    ['不', '时', '之', '需'],
    ['bu', 'shi', 'zhi', 'xu'],
  ],
  [
    ['自', '告', '奋', '勇'],
    ['zi', 'gao', 'fen', 'yong'],
  ],
  [
    ['东', '山', '再', '起'],
    ['dong', 'shan', 'zai', 'qi'],
  ],
  [
    ['锒', '铛', '入', '狱'],
    ['lang', 'dang', 'ru', 'yu'],
  ],
  [
    ['石', '沉', '大', '海'],
    ['shi', 'chen', 'da', 'hai'],
  ],
  [
    ['隐', '姓', '埋', '名'],
    ['yin', 'xing', 'mai', 'ming'],
  ],
  [
    ['愤', '愤', '不', '平'],
    ['fen', 'fen', 'bu', 'ping'],
  ],
  [
    ['一', '鼓', '作', '气'],
    ['yi', 'gu', 'zuo', 'qi'],
  ],
  [
    ['心', '安', '理', '得'],
    ['xin', 'an', 'li', 'de'],
  ],
  [
    ['千', '头', '万', '绪'],
    ['qian', 'tou', 'wan', 'xu'],
  ],
  [
    ['冰', '天', '雪', '地'],
    ['bing', 'tian', 'xue', 'di'],
  ],
  [
    ['后', '起', '之', '秀'],
    ['hou', 'qi', 'zhi', 'xiu'],
  ],
  [
    ['谨', '言', '慎', '行'],
    ['jin', 'yan', 'shen', 'xing'],
  ],
  [
    ['时', '过', '境', '迁'],
    ['shi', 'guo', 'jing', 'qian'],
  ],
  [
    ['唯', '利', '是', '图'],
    ['wei', 'li', 'shi', 'tu'],
  ],
  [
    ['居', '高', '临', '下'],
    ['ju', 'gao', 'lin', 'xia'],
  ],
  [
    ['事', '无', '巨', '细'],
    ['shi', 'wu', 'ju', 'xi'],
  ],
  [
    ['无', '孔', '不', '入'],
    ['wu', 'kong', 'bu', 'ru'],
  ],
  [
    ['势', '不', '可', '挡'],
    ['shi', 'bu', 'ke', 'dang'],
  ],
  [
    ['烟', '消', '云', '散'],
    ['yan', 'xiao', 'yun', 'san'],
  ],
  [
    ['席', '地', '而', '坐'],
    ['xi', 'di', 'er', 'zuo'],
  ],
  [
    ['豁', '然', '开', '朗'],
    ['huo', 'ran', 'kai', 'lang'],
  ],
  [
    ['义', '愤', '填', '膺'],
    ['yi', 'fen', 'tian', 'ying'],
  ],
  [
    ['不', '进', '则', '退'],
    ['bu', 'jin', 'ze', 'tui'],
  ],
  [
    ['身', '先', '士', '卒'],
    ['shen', 'xian', 'shi', 'zu'],
  ],
  [
    ['一', '概', '而', '论'],
    ['yi', 'gai', 'er', 'lun'],
  ],
  [
    ['敷', '衍', '了', '事'],
    ['fu', 'yan', 'liao', 'shi'],
  ],
  [
    ['高', '枕', '无', '忧'],
    ['gao', 'zhen', 'wu', 'you'],
  ],
  [
    ['巧', '立', '名', '目'],
    ['qiao', 'li', 'ming', 'mu'],
  ],
  [
    ['万', '不', '得', '已'],
    ['wan', 'bu', 'de', 'yi'],
  ],
  [
    ['震', '耳', '欲', '聋'],
    ['zhen', 'er', 'yu', 'long'],
  ],
  [
    ['今', '非', '昔', '比'],
    ['jin', 'fei', 'xi', 'bi'],
  ],
  [
    ['拉', '帮', '结', '派'],
    ['la', 'bang', 'jie', 'pai'],
  ],
  [
    ['手', '舞', '足', '蹈'],
    ['shou', 'wu', 'zu', 'dao'],
  ],
  [
    ['千', '呼', '万', '唤'],
    ['qian', 'hu', 'wan', 'huan'],
  ],
  [
    ['遥', '遥', '领', '先'],
    ['yao', 'yao', 'ling', 'xian'],
  ],
  [
    ['相', '濡', '以', '沫'],
    ['xiang', 'ru', 'yi', 'mo'],
  ],
  [
    ['先', '入', '为', '主'],
    ['xian', 'ru', 'wei', 'zhu'],
  ],
  [
    ['横', '七', '竖', '八'],
    ['heng', 'qi', 'shu', 'ba'],
  ],
  [
    ['痛', '心', '疾', '首'],
    ['tong', 'xin', 'ji', 'shou'],
  ],
  [
    ['化', '整', '为', '零'],
    ['hua', 'zheng', 'wei', 'ling'],
  ],
  [
    ['阳', '奉', '阴', '违'],
    ['yang', 'feng', 'yin', 'wei'],
  ],
  [
    ['沉', '默', '寡', '言'],
    ['chen', 'mo', 'gua', 'yan'],
  ],
  [
    ['顺', '手', '牵', '羊'],
    ['shun', 'shou', 'qian', 'yang'],
  ],
  [
    ['渐', '入', '佳', '境'],
    ['jian', 'ru', 'jia', 'jing'],
  ],
  [
    ['束', '手', '就', '擒'],
    ['shu', 'shou', 'jiu', 'qin'],
  ],
  [
    ['心', '无', '旁', '骛'],
    ['xin', 'wu', 'pang', 'wu'],
  ],
  [
    ['振', '聋', '发', '聩'],
    ['zhen', 'long', 'fa', 'kui'],
  ],
  [
    ['杳', '无', '音', '讯'],
    ['yao', 'wu', 'yin', 'xun'],
  ],
  [
    ['情', '有', '可', '原'],
    ['qing', 'you', 'ke', 'yuan'],
  ],
  [
    ['尽', '力', '而', '为'],
    ['jin', 'li', 'er', 'wei'],
  ],
  [
    ['投', '机', '取', '巧'],
    ['tou', 'ji', 'qu', 'qiao'],
  ],
  [
    ['小', '题', '大', '做'],
    ['xiao', 'ti', 'da', 'zuo'],
  ],
  [
    ['约', '法', '三', '章'],
    ['yue', 'fa', 'san', 'zhang'],
  ],
  [
    ['不', '屑', '一', '顾'],
    ['bu', 'xie', 'yi', 'gu'],
  ],
  [
    ['自', '圆', '其', '说'],
    ['zi', 'yuan', 'qi', 'shuo'],
  ],
  [
    ['人', '尽', '其', '才'],
    ['ren', 'jin', 'qi', 'cai'],
  ],
  [
    ['随', '波', '逐', '流'],
    ['sui', 'bo', 'zhu', 'liu'],
  ],
  [
    ['望', '子', '成', '龙'],
    ['wang', 'zi', 'cheng', 'long'],
  ],
  [
    ['鸡', '毛', '蒜', '皮'],
    ['ji', 'mao', 'suan', 'pi'],
  ],
  [
    ['肃', '然', '起', '敬'],
    ['su', 'ran', 'qi', 'jing'],
  ],
  [
    ['束', '之', '高', '阁'],
    ['shu', 'zhi', 'gao', 'ge'],
  ],
  [
    ['因', '噎', '废', '食'],
    ['yin', 'ye', 'fei', 'shi'],
  ],
  [
    ['另', '起', '炉', '灶'],
    ['ling', 'qi', 'lu', 'zao'],
  ],
  [
    ['青', '黄', '不', '接'],
    ['qing', 'huang', 'bu', 'jie'],
  ],
  [
    ['面', '面', '俱', '到'],
    ['mian', 'mian', 'ju', 'dao'],
  ],
  [
    ['天', '涯', '海', '角'],
    ['tian', 'ya', 'hai', 'jiao'],
  ],
  [
    ['语', '无', '伦', '次'],
    ['yu', 'wu', 'lun', 'ci'],
  ],
  [
    ['朗', '朗', '上', '口'],
    ['lang', 'lang', 'shang', 'kou'],
  ],
  [
    ['舍', '近', '求', '远'],
    ['she', 'jin', 'qiu', 'yuan'],
  ],
  [
    ['置', '身', '事', '外'],
    ['zhi', 'shen', 'shi', 'wai'],
  ],
  [
    ['鞠', '躬', '尽', '瘁'],
    ['ju', 'gong', 'jin', 'cui'],
  ],
  [
    ['活', '蹦', '乱', '跳'],
    ['huo', 'beng', 'luan', 'tiao'],
  ],
  [
    ['不', '寒', '而', '栗'],
    ['bu', 'han', 'er', 'li'],
  ],
  [
    ['明', '辨', '是', '非'],
    ['ming', 'bian', 'shi', 'fei'],
  ],
  [
    ['言', '简', '意', '赅'],
    ['yan', 'jian', 'yi', 'gai'],
  ],
  [
    ['鸟', '语', '花', '香'],
    ['niao', 'yu', 'hua', 'xiang'],
  ],
  [
    ['避', '而', '不', '谈'],
    ['bi', 'er', 'bu', 'tan'],
  ],
  [
    ['头', '头', '是', '道'],
    ['tou', 'tou', 'shi', 'dao'],
  ],
  [
    ['安', '营', '扎', '寨'],
    ['an', 'ying', 'zha', 'zhai'],
  ],
  [
    ['风', '尘', '仆', '仆'],
    ['feng', 'chen', 'pu', 'pu'],
  ],
  [
    ['前', '无', '古', '人'],
    ['qian', 'wu', 'gu', 'ren'],
  ],
  [
    ['无', '可', '非', '议'],
    ['wu', 'ke', 'fei', 'yi'],
  ],
  [
    ['无', '所', '不', '能'],
    ['wu', 'suo', 'bu', 'neng'],
  ],
  [
    ['筋', '疲', '力', '尽'],
    ['jin', 'pi', 'li', 'jin'],
  ],
  [
    ['张', '灯', '结', '彩'],
    ['zhang', 'deng', 'jie', 'cai'],
  ],
  [
    ['一', '哄', '而', '上'],
    ['yi', 'hong', 'er', 'shang'],
  ],
  [
    ['不', '由', '分', '说'],
    ['bu', 'you', 'fen', 'shuo'],
  ],
  [
    ['酣', '畅', '淋', '漓'],
    ['han', 'chang', 'lin', 'li'],
  ],
  [
    ['南', '辕', '北', '辙'],
    ['nan', 'yuan', 'bei', 'zhe'],
  ],
  [
    ['冒', '名', '顶', '替'],
    ['mao', 'ming', 'ding', 'ti'],
  ],
  [
    ['不', '义', '之', '财'],
    ['bu', 'yi', 'zhi', 'cai'],
  ],
];
